[
  {
    "id": "19ad71f814efeb78",
    "from": "The Neuron <theneuron@newsletter.theneurondaily.com>",
    "subject": "? ChatGPT turns 3. Your job might not make it to 4.",
    "date": "2025-11-30T23:35:56.000Z",
    "text": "View image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/68d54b22-09fc-4ee6-ad49-d0fe8dc33630/The_Neuron_Header_-_12.1.2025.png?t=1764539132)\r\nCaption: \r\n\r\nWelcome, humans. \r\n\r\nChatGPT turned 3 today. Azeem Azhar of [Exponential View](https://www.exponentialview.co/p/ten-things-im-thinking-about-ai-part1) shared his reflections on it, and recapped his beliefs about the industry and where its headed across 4 parts. \r\n\r\nIn [Part 1](https://www.exponentialview.co/p/ten-things-im-thinking-about-ai-part1), he shows AI revenue hit $60B in 2 years, with API usage growing 300% annually. The catch? Only 20% of companies see real value because adopting AI requires painful org restructuring. [Part 2](https://www.exponentialview.co/p/ten-things-ai-part-2) identifies energy as the ultimate bottleneck; US power grids have 4-9 year wait times for new connections, forcing companies to build their own solar installations instead of massive data center clusters. [Part 3](https://www.exponentialview.co/p/ten-things-im-thinking-about-ai-part) digs into the economics: if GPUs last 6 years instead of 3, the entire investment thesis changes, and 2026 becomes the year productivity gains must materialize or the bubble pops. [Part 4](https://www.exponentialview.co/p/ten-things-im-thinking-about-ai-part-4) zooms out to geopolitics: AI is fracturing into US-aligned, China-aligned, and non-aligned camps, while 900M people use tools that 75% of Americans simultaneously distrust. He also explores how AI's biggest [productivity gains](https://www.exponentialview.co/p/ev-552) are ?invisible,? hiding in admin and finance work rather than flashy tech jobs. Plus, he even [narrated his own retrospective](https://www.exponentialview.co/p/chatgpt-in-history) to explain how the ?exponential age is unfolding in real time.?  \r\n\r\nAlso, we [put together our own retrospective on the three years since ChatGPT launched](https://www.theneuron.ai/explainer-articles/three-years-of-chatgpt-a-retrospective-2022-2025)... _written by ChatGPT. _\r\n\r\n_Meta? Yes. Good? Also yes. It?s really impressive to see how well AI can write, research, and reflect since it launched in 2022. We?ve come a long way, ya?ll. _\r\n\r\n**Here?s what happened in AI today:**\r\n\r\n1. MIT released Project Iceberg showing AI can replace 11.7% of American workers today.\r\n\r\n2. Shai-Hulud malware compromised 800+ npm packages from Zapier, PostHog, and Postman.\r\n\r\n3. OpenAI and Google cut free access to Sora 2 and Gemini 3 Pro amid rising costs.\r\n\r\n4. Suno's users generate 7M AI tracks daily, recreating Spotify's catalog every two weeks.\r\n\r\nAdvertise in The Neuron here! (https://info.technologyadvice.com/advertise-with-the-neuron)\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/34bc2586-ee40-4ae7-83d2-f896136a8326/image.png?t=1762454325)\r\nCaption: \r\n\r\n# MIT Just Built a Digital Twin of Every American Worker?And the Results Are Sobering\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c8759d1f-2d6a-40a0-ab29-68dab0743b05/Screenshot_2025-11-30_at_1.57.43_PM.png?t=1764540550)\r\nFollow image link: (https://iceberg.mit.edu/)\r\nCaption: \r\n\r\n**DEEP DIVE: **[**MIT?s Project Iceberg and what experts predict will happen next with AI and jobs**](https://www.theneuron.ai/explainer-articles/mit-just-built-a-digital-twin-of-every-american-worker--and-the-results-are-sobering)\r\n\r\nRemember when everyone said AI would only replace tech jobs? Turns out, they were looking at the tip of the iceberg.\r\n\r\nMIT and Oak Ridge National Laboratory just released [Project Iceberg](https://iceberg.mit.edu/), a massive simulation that tracked 151M US workers across 32K skills and 923 occupations to figure out which jobs AI can already automate _today_.\r\n\r\nThe findings = AI can technically replace 11.7% of the American workforce right now? affecting $1.2 trillion in wages. That's not a prediction for 2030. _That's what's possible with current technology._\r\n\r\nHere's the twist: if you only look at where AI is actually deployed (mainly computing and tech), just 2.2% of jobs seem affected. MIT calls this the \"Surface Index.\" Below the surface lurks cognitive work in finance, healthcare, and administrative roles that AI could automate but hasn't yet.\r\n\r\n**What changed everything:** [The Model Context Protocol](https://www.anthropic.com/news/model-context-protocol) (MCP). Until late 2024, AI assistants were stuck outside your work ecosystem, unable to access your actual tools. Anthropic's MCP changed that?it lets any AI model plug into any data source or tool through standardized connections.\r\n\r\nThe explosion happened fast. As of March 2025, there are [7,950+ MCP servers](https://mcpmarket.com/server) available. AI agents can now autonomously check calendars, book rooms, send invites, update project plans, and generate financial reports. Project Iceberg tracks every one of these servers and maps them against workforce skills in real-time.\r\n\r\n**Plot twist:** The biggest impact isn't in Silicon Valley. Rust Belt states like Ohio, Michigan, and Tennessee show massive vulnerability because cognitive work supporting manufacturing (financial analysis, admin coordination, professional services) is highly automatable. _If you work in these fields and states, don?t share this report w/ your boss? _ \r\n\r\n**Here?s what the experts think:** A [study of 339 superforecasters and AI experts](https://leap.forecastingresearch.org/reports/waves-1-to-3-insights#1-experts-expect-sizable-societal-effects-from-ai-by-2040) (the Longitudinal Expert AI Panel) predicts 18% of work hours will be AI-assisted by 2030, close to MIT's 11.7% current number. _So their takes feel directionally correct. _\r\n\r\n**Why this matters:** Project Iceberg is an early warning system. States are [already using it to identify at-risk skills](https://www.cnbc.com/2025/11/26/mit-study-finds-ai-can-already-replace-11point7percent-of-us-workforce.html) and build retraining programs. The question isn't whether AI will transform work, but whether we're building the infrastructure to handle 21M potentially displaced workers before the iceberg hits. [Read the rest here](https://www.theneuron.ai/explainer-articles/mit-just-built-a-digital-twin-of-every-american-worker--and-the-results-are-sobering). \r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/2406a12e-9fba-4e0e-a97a-ac78b7d48009/image.png?t=1762454334)\r\nCaption: \r\n\r\n**FROM OUR PARTNERS**\r\n\r\n### Run ads IRL with AdQuick\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/56e2a130-f390-4395-b9b3-a8b71bb22dd2/AdQuick_Newsletter_Hero_2025_2.png?t=1738376710)\r\nFollow image link: (https://www.AdQuick.com/?utm_campaign=YJ4ZPRQDHV&utm_source=beehiiv&_bhiiv=opp_6d9f83e3-5109-45ca-950b-fee29a336aff_c33e6721&bhcl_id=b09f7309-de17-475e-b873-1cb549f38d68_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nWith [AdQuick](https://www.AdQuick.com/?utm_campaign=YJ4ZPRQDHV&utm_source=beehiiv&_bhiiv=opp_6d9f83e3-5109-45ca-950b-fee29a336aff_c33e6721&bhcl_id=b09f7309-de17-475e-b873-1cb549f38d68_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492), you can now easily plan, deploy and measure campaigns just as easily as digital ads, making them a no-brainer to add to your team?s toolbox.\r\n\r\nYou can learn more at [www.AdQuick.com](https://www.AdQuick.com/?utm_campaign=YJ4ZPRQDHV&utm_source=beehiiv&_bhiiv=opp_6d9f83e3-5109-45ca-950b-fee29a336aff_c33e6721&bhcl_id=b09f7309-de17-475e-b873-1cb549f38d68_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6bc85194-60ad-4700-a890-08be35e73a02/image.png?t=1762454365)\r\nCaption: \r\n\r\n# Prompt Tip of the Day\r\n\r\nSo like, WTF are [Claude Skills](https://www.claude.com/blog/skills)? We had only just figured out [MCP Servers](https://www.anthropic.com/news/model-context-protocol) (_which connect Claude or ChatGPT to external data sources like GitHub, Slack, and databases through a standardized protocol_) when Anthropic released these puppies. Now we gotta learn a new thing?? \r\n\r\nLuckily, Anthropic just produced an [explainer video](https://www.anthropic.com/news/skills) to walk us through this and explain when to use all of their different features. Here's how:\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6299ed34-d1d9-4663-8edc-440c05acc031/Screenshot_2025-11-26_at_6.39.39_PM.png?t=1764211198)\r\nFollow image link: (https://youtu.be/fOxC44g8vig?si=2seHiDKzB0zoharJ)\r\nCaption: \r\n\r\nThink of building your AI coding setup like assembling a specialized team. _Claude.md_ files tell Claude about your specific project?things like tech stack, coding conventions, and repo structure. Skills are portable expertise that work across any project, teaching Claude specialized tasks. MCP servers provide universal integration, connecting Claude to external data. And sub-agents are specialized AI assistants with fixed roles, each with their own context window and custom prompts [Claude](https://claude.com/blog/skills).\r\n\r\n**The Setup Order for Beginners:**\r\n\r\n1. [**Claude.md files**](https://Claude.md) first (run `/init` in Claude Code) ? Sets your foundation with project structure and standards\r\n\r\n2. [**MCP servers**](https://modelcontextprotocol.io/quickstart/server) next ? Connects to tools you use daily (GitHub, Google Drive, Slack)\r\n\r\n3. [**Skills**](https://github.com/anthropics/skills) third ? Enable Anthropic's pre-built Skills (docx, pptx, xlsx, pdf) for document creation\r\n\r\n4. [**Sub-agents**](https://code.claude.com/docs/en/sub-agents) last ? Create specialized agents as you identify repetitive workflow patterns\r\n\r\n**How they work together:** Your [Claude.md](https://Claude.md) file sets the foundation, MCP servers connect the data, sub-agents specialize in their roles, and skills bring the expertise?making every piece smarter and more capable [Claude](https://claude.com/blog/skills).\r\n\r\n**Our favorite insight:** Skills use progressive disclosure?Claude only loads what's needed, when it's needed [Anthropic](https://www.anthropic.com/engineering/equipping-agents-for-the-real-world-with-agent-skills). Each skill consumes just 30-50 tokens at startup, with full content loading only when relevant. This means you can install 20+ skills without bloating your context window.\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e3774230-5ffd-4020-b888-79c2eb10db1a/image.png?t=1762454392)\r\nCaption: \r\n\r\n# Treats to Try \r\n\r\n_*Asterisk = from our partners (only the first one!). __[Advertise to 600K daily readers here](https://info.technologyadvice.com/advertise-with-the-neuron)__!_\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5ebf4ebf-d266-4fbf-8853-794b35ca4562/dell-pro-max-fcm1253-micro-desktop-c-rf-bk-1280x1280.jpeg?t=1763931407)\r\nFollow image link: (https://www.dell.com/en-us/shop/desktop-computers/dell-pro-max-with-gb10/spd/dell-pro-max-fcm1253-micro/xcto_fcm1253_usx?utm_source=TheNeuron&utm_medium=Email&utm_campaign=FY26Q4)\r\nCaption: \r\n\r\n1. *Most workstations tap out at 24GB. [Dell Pro Max with GB10](https://www.dell.com/en-us/shop/desktop-computers/dell-pro-max-with-gb10/spd/dell-pro-max-fcm1253-micro/xcto_fcm1253_usx?utm_source=TheNeuron&utm_medium=Email&utm_campaign=FY26Q4)'s 128GB lets you run AI models up to 200B parameters?_including ones that beat GPT-4o! _Run NVIDIA Nemotron 70B (currently outranking GPT-4o on benchmarks), fine-tune Llama 3.3 on your own data, or chain two units together for 405B models. This isn't a toy for experimenting with 7B models?it's built for teams doing real AI development work that requires serious horsepower. [Check the specs here](https://www.dell.com/en-us/shop/desktop-computers/dell-pro-max-with-gb10/spd/dell-pro-max-fcm1253-micro/xcto_fcm1253_usx?utm_source=TheNeuron&utm_medium=Email&utm_campaign=FY26Q4).\r\n\r\n2. [Manus Browser Operator](https://chromewebstore.google.com/detail/manus-browser-operator/cecngibhkljoiafhjfmcgbmikfogdiko) automates tasks in sites you're logged into?like pulling competitor data from Crunchbase or filling CRM fields?using your existing sessions.\r\n\r\n3. [Vercel?s Workflow Builder](https://workflow-builder.dev/) lets you build multi-step automation visually by dragging and dropping workflow steps, like sending emails via Resend, creating Linear tickets, or querying databases?then exports production-ready TypeScript code you can; here?s a [template you can deploy](https://vercel.com/templates/ai/workflow-builder). \r\n\r\n4. [VASA-1](https://www.microsoft.com/en-us/research/project/vasa-1/) from Microsoft takes a single portrait photo and speech audio to generate realistic talking face videos at 512?512 resolution with precise lip-sync, lifelike facial expressions, and natural head movements?running at up to 40 FPS with only 170ms latency ([paper](https://arxiv.org/pdf/2404.10667)).\r\n\r\n5. [Ripplica](https://www.ripplica.com/) records you doing a browser task once (like pulling reports or updating dashboards), then repeats that exact workflow for you automatically?even with old legacy systems and internal tools.\r\n\r\n6. [Fara-7B](https://huggingface.co/microsoft/Fara-7B) from Microsoft automates web tasks by taking screenshots and clicking/typing for you, like finding the right shoes and adding them to cart, or navigating to a restaurant's booking page.\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/b4e1fb39-fa43-4ddc-81a6-c9b4bbb80e5e/image.png?t=1762454407)\r\nCaption: \r\n\r\n# Around the Horn\r\n\r\n1. [OpenAI and Google](https://www.tomsguide.com/ai/google-and-openai-are-cutting-back-free-usage-for-gemini-3-pro-and-sora-2-here-are-the-new-limits) quietly cut back free access to Sora 2 and Gemini 3 Pro, slashing free video and image generations as ?melting? GPUs and soaring infrastructure costs forced them to tighten usage caps for non?paying users.\r\n\r\n2. [Poetiq](https://poetiq.ai/posts/arcagi_announcement/) achieved new state-of-the-art results on ARC-AGI benchmarks by building intelligence on top of recently released models like Gemini 3 and GPT-5.1.\r\n\r\n3. A second wave of the [Shai-Hulud malware worm](https://socket.dev/blog/shai-hulud-strikes-again-v2) (allegedly [built with AI?s help](https://unit42.paloaltonetworks.com/npm-supply-chain-attack/)) compromised over 800 npm packages (open code packages) from major organizations including Zapier, PostHog, and Postman, affecting 25K+ GitHub repositories and spreading malware that steals developer credentials during package installation ([more](https://about.gitlab.com/blog/gitlab-discovers-widespread-npm-supply-chain-attack/)); _this is a good warning to watch what packages your AI coder installs. _\r\n\r\n4. [Billboard](https://www.billboard.com/pro/suno-creates-spotify-catalog-music-two-weeks-pitch-deck/)?s look at Suno?s investor deck says the app?s 1M+ subscribers are generating around 7M AI tracks a day, effectively recreating Spotify?s 100M?song catalog _every two weeks,_ and showing how fast AI-native catalogs are outpacing human-made music in sheer volume.\r\n\r\n5. [Amazon](https://www.geekwire.com/2025/amazon-unveils-ai-powered-augmented-reality-glasses-for-delivery-drivers/) unveiled AI?powered AR glasses for delivery drivers that overlaid navigation, hazard alerts, and package info directly into their field of view.\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/32bd7206-d05f-4547-b00e-928c9ea16b90/image.png?t=1762454460)\r\nCaption: \r\n\r\n# Intelligent Insights\r\n\r\n1. [Michael Krastios](https://youtu.be/JbTDK4Izw1Q?si=McQy2xBFxh1_jdtK) is leading the White House's AI action plan through three strategic pillars: regulatory frameworks for innovation, infrastructure development (particularly energy and data centers), and exporting the American AI stack globally?but revealed the administration's primary concern isn't China's capabilities (despite their open-source models dominating through API distillation techniques) but rather America's failure to adopt AI fast enough, emphasizing the U.S. has a narrow window to leverage its AI chip manufacturing dominance before China's SMIC catches up, while pushing for federal AI standards over state-level patchwork regulations that entrench incumbents and calling for K-12 AI education focused on understanding technology limitations rather than just using tools like ChatGPT.\r\n\r\n2. Scott Alexander of Astral Star Codex systematically dismantled the argument that [AI safety regulation threatens America's AI race with China](https://www.astralcodexten.com/p/why-ai-safety-wont-make-america-lose), showing that proposed safety bills (requiring model spec disclosure, whistleblower protection, and testing for infrastructure hacking capabilities) would add only ~1-2% to training costs while the US maintains a 10x compute advantage?but allowing NVIDIA to export advanced chips to China, as the Trump administration has repeatedly considered, could collapse that 30x advantage down to 1.7x, making chip exports orders of magnitude more dangerous than any safety regulation on the table.\r\n\r\n3. The Peter H. Diamandis podcast argued Department of Energy is** **[turning America into ?one big AI factory?](https://youtu.be/zJ9kejR4PeQ?si=TapOiAzWL2MWRbtD) by connecting federal supercomputers with previously locked scientific data sets to compress research timelines from years to days across biotech, fusion, and quantum domains, with mission director Dario Gil tasked to double American scientific productivity by 2035, though the panel argues anything less than 10x-100x improvement would represent failure, especially as Anthropic's Claude Opus 4.5 just proved AI can now outperform human engineering teams while using 76% fewer tokens at 67% lower cost ($25 per million tokens), which Emad Mostaque says is important because Opus is a great orchestrator of other agents. \r\n\r\n4. [Gary Marcus raised suspicions](https://garymarcus.substack.com/p/has-the-bailout-of-generative-ai) that the Trump administration's Genesis AI program?which directs government agencies to purchase AI chips and compute for scientific research?might be a disguised bailout for overextended AI companies, noting that White House AI czar David Sacks's position flipped from ?read my lips, no AI bailout? (November 6) to ?we can't afford to let this crash? (November 24) just hours before the program's announcement, with multiple industry observers and analysts describing the initiative as _?socialism for the rich.?_\r\n\r\n5. [Strange Loop Cannon](https://www.strangeloopcanon.com/p/epicycles-all-the-way-down) argues LLMs are fundamentally pattern-fitters rather than rule-discoverers, demonstrating through experiments that models fail to learn simple cellular automata rules and approximate planetary orbits with epicycles instead of finding inverse-square laws?explaining why they achieve superhuman performance on most tasks yet fail in alien ways, making their intelligence closer to market intelligence (powerful but opaque) than individual reasoning, and suggesting alignment will require treating them like other superintelligences we govern (economies, markets) rather than rational agents.\r\n\r\n6. [Evan Armstrong](https://www.gettheleverage.com/p/the-future-of-software-isnt-software) argued that the future winners in software will be marketplaces with unified customer identity or AI?native systems of record, not traditional standalone SaaS apps.\r\n\r\n7. SemiAnalysis? [Google?s TPUv7 ?Ironwood? deep?dive](https://newsletter.semianalysis.com/p/tpuv7-google-takes-a-swing-at-the) claimed the company is rolling out hundreds of thousands of custom TPUs through GCP, making it the 900?pound gorilla challenging NVIDIA?s AI chip dominance.\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/35ade56c-dc70-4dd0-b632-41c7c45a953a/image.png?t=1762454492)\r\nCaption: \r\n\r\n# A Cat?s Commentary\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/07b9c7ed-117f-458a-b7a2-4a3216fd0634/A_Cat_s_Commentary_x_2025__82_.png?t=1764539124)\r\nCaption: \r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/48e1e056-a015-4e20-ba68-dafb942cfae7/image.png?t=1762454543)\r\nCaption: \r\n\r\n\r\n\r\nThat?s all for today!\r\n\r\n\r\n\r\n\r\n\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/77725261-a9a1-4f4b-9b32-5df2cf3f0b60/image.png?t=1762454662)\r\nCaption: \r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.theneurondaily.com/p/mit-11-7-of-us-jobs-could-vanish-today"
  }
]