[
  {
    "id": "19b485fb8afc12f6",
    "from": "AI Brief - Essential Brief <hello@essentialbrief.com>",
    "subject": "? Google Acquires Intersect Power, ?? Ontinue Warns Nezha Trojan Abuse, ? Anthropic Launches Bloom AI Tool.",
    "date": "2025-12-22T23:23:10.000Z",
    "text": "Stay ahead with world news, business, and markets?concise, powerful, and relevant.\r\n\r\n[View Online](https://essentialbrief.com/ai/newsletter.html) | 22 December 2025 | [Join Free!!](https://essentialbrief.com/ai.html)\r\n\r\n?????\r\n\r\nAI\r\n\r\n[Artwork by Jean Michel Basquiat]\r\n\r\n\"? Google Acquires Intersect Power, ?? Ontinue Warns Nezha Trojan Abuse, ? Anthropic Launches Bloom AI Tool.\", inspired by Jean Michel Basquiat.\r\n\r\nHi there, this is your daily dose of AI Brief.\r\n\r\nToday?s highlights:\r\n\r\n? Google buys Intersect Power for $4.75B.\r\n\r\n? Anthropic releases Bloom for AI behavior testing.\r\n\r\n?? Ontinue warns on Nezha tool?s trojan abuse.\r\n\r\n? OptScale cuts LLM inference costs with theory.\r\n\r\n? Firefox adds AI kill switch for privacy control.\r\n\r\n? Microsoft plans 200,000+ Copilot licenses in India.\r\n\r\n?? Nvidia releases Nemotron 3 for agentic AI systems.\r\n\r\n? Insect Scent Decoded, ? Data Center Boom, ??? Tesco AI Deal, ? Reinforcement Learning Simplified, ?? Universal Gaming AI.\r\n\r\nEssential Brief Newsletters.\r\n\r\nExplore More from Essential Brief\r\n\r\n? Board ? Stay on top of global affairs, business, and markets in 5 minutes a day.\r\n\r\n? Crypto ? The fastest way to catch up with Bitcoin, DeFi, NFTs, and regulations.\r\n\r\n????? AI ? Daily updates on breakthroughs, tools, and industry trends.\r\n\r\n? [Subscribe all at Essential Brief.](https://essentialbrief.com/?utm_source=essentialbrief&utm_medium=essentialbrief&utm_campaign=cross)\r\n\r\nThe Essentials:\r\n\r\n[? Google buys Intersect Power for $4.75B.](https://www.nytimes.com/2025/12/22/technology/google-intersect-data-centers.html)\r\n\r\n- Google acquires Intersect Power for $4.75B, expanding its renewable energy portfolio and capacity significantly.\r\n- This strategic move enhances Google's energy infrastructure, aligning with sustainability and operational goals.\r\n- The acquisition positions Google to lead in clean energy, though integration and market dynamics pose future challenges.\r\n\r\n[? Anthropic releases Bloom for AI behavior testing.](https://siliconangle.com/2025/12/22/anthropic-announces-bloom-open-source-tool-researchers-evaluating-ai-behavior/)\r\n\r\n- Anthropic released Bloom, an open-source framework to define and test specific AI behaviors via scenario-based evaluation.\r\n- Bloom automates behavior testing, aligning AI with human values by simulating interactions and scoring model responses.\r\n- This tool aids ethical AI development, addressing risks like misinformation and bias, crucial for future AI governance frameworks.\r\n\r\n[?? Ontinue warns on Nezha tool?s trojan abuse.](https://siliconangle.com/2025/12/22/ontinue-warns-attackers-abusing-nezha-monitoring-tool-stealthy-remote-access-trojan/)\r\n\r\n- Ontinue reveals Nezha, a legitimate monitoring tool, is exploited as a stealthy remote access trojan granting SYSTEM/root access.\r\n- This abuse evades signature-based defenses by mimicking legitimate telemetry and using unmodified software undetected by antivirus.\r\n- Widespread compromise risks persistence and lateral movement; behavioral monitoring and strict RMM tool controls are advised for defense.\r\n\r\n[? OptScale cuts LLM inference costs with theory.](https://arxiv.org/abs/2506.22376)\r\n\r\n- OptScale introduces a probabilistic framework optimizing inference-time scaling by dynamically selecting minimal samples for target performance. It establishes theoretical lower bounds on sample requirements, guiding compute-efficient scaling under i.i.d. assumptions for parallel samples. Experiments on benchmarks like MATH-500 and GSM8K show OptScale reduces sampling overhead while matching or exceeding state-of-the-art reasoning accuracy. This principled approach enhances LLM deployment efficiency by replacing heuristics with theory-driven sampling decisions. OptScale?s dynamic sampling strategy promises scalable, cost-effective LLM inference, potentially transforming resource allocation in complex reasoning tasks. Future work may explore integration challenges and adaptation to diverse model architectures.\r\n\r\n[? Firefox adds AI kill switch for privacy control.](https://www.computerworld.com/article/4110573/firefox-gets-a-kill-switch-for-ai-features.html)\r\n\r\n- Firefox will launch an AI kill switch in Q1 2026, allowing users to disable all AI features within the browser.\r\n- This feature enhances user privacy control, addressing concerns about AI integration in modern web browsers.\r\n- The kill switch sets a precedent for transparent AI use, balancing innovation with user autonomy and potential regulatory demands.\r\n\r\n[? Microsoft plans 200,000+ Copilot licenses in India.](https://www.artificialintelligence-news.com/news/service-provider-ai-implementations-india-enterprise-scale-copilot-rollouts/)\r\n\r\n- Data center investments will reach a record $61B in 2025, driven primarily by US and Canada expenditures and AI initiatives.\r\n- This surge highlights significant infrastructure scaling, addressing AI's growing compute and power demands globally.\r\n- Future growth hinges on energy solutions; nuclear power gains interest amid challenges securing affordable, reliable energy.\r\n\r\n[?? Nvidia releases Nemotron 3 for agentic AI systems.](https://www.marktechpost.com/2025/12/20/nvidia-ai-releases-nemotron-3-a-hybrid-mamba-transformer-moe-stack-for-long-context-agentic-ai/)\r\n\r\n- Nvidia announces Nemotron 3, enhancing agentic AI systems with improved performance and capabilities. It boosts autonomous decision-making precision. Nemotron 3's efficiency gains drive scalable AI integration in complex environments. This release sets the stage for advanced AI applications and evolving system challenges.\r\n\r\nOther spark insights!\r\n\r\n[? Machine learning decodes insect scent patterns.](https://aihub.org/2025/12/19/identifying-patterns-in-insect-scents-using-machine-learning/)\r\n\r\n[? Data center investments hit record $61B in 2025.](https://www.networkworld.com/article/4110602/data-center-investments-break-all-records.html)\r\n\r\n[??? Tesco inks three-year AI deal for customer tools.](https://www.artificialintelligence-news.com/news/tesco-signs-three-year-ai-deal-centred-on-customer-experience/)\r\n\r\n[? Agent Lightning adds reinforcement learning without rewrites.](https://www.microsoft.com/en-us/research/blog/agent-lightning-adding-reinforcement-learning-to-ai-agents-without-code-rewrites/)\r\n\r\n[?? Nvidia launches NitroGen for universal gaming AI agents.](https://the-decoder.com/nvidia-wants-to-create-universal-ai-agents-for-all-worlds-with-nitrogen/)\r\n\r\nEnjoying this newsletter?\r\n\r\nForward to a friend and help them stay ahead of the curve.\r\n\r\n[Subscribe](https://essentialbrief.com/ai.html)\r\n\r\nDo you want to talk? Send me a  [message](mailto:hello@essentialbreif.com)\r\n\r\nYou were sent this message because you subscribed to AI Brief [unsubscribe](mailto:hello@hessentialbrief.com)"
  }
]