[
  {
    "id": "19a32366e0c0f252",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "Microsoft Now Owns 27% Of OpenAI As They Plan Their IPO",
    "date": "2025-10-29T23:03:39.000Z",
    "text": "### Don?t get SaaD. Get Rippling. \r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/692c651e-52b0-49a9-b308-65c32139ae34/Beehive-6.jpg?t=1758900090)\r\nFollow image link: (https://ste7galwmb2.typeform.com/to/OpiBm9ld/?utm_source=beehiiv&utm_medium=affiliate&utm_campaign=VPSLCCALRN&utm_term=CorpCampaign-SaaD&_bhiiv=opp_285d44e6-fe58-4266-a4fc-c2919e313d9d_7ad634bd&bhcl_id=bff1f132-6356-4f44-b7d2-b13d4660ba1a_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nDisconnected software creates what we call SaaD, or Software as a Disservice: wasted time, duplicate work, and stalled momentum. From onboarding checklists to reconciling expenses, [SaaD slows every team down.](https://ste7galwmb2.typeform.com/to/OpiBm9ld/?utm_source=beehiiv&utm_medium=affiliate&utm_campaign=VPSLCCALRN&utm_term=CorpCampaign-SaaD&_bhiiv=opp_285d44e6-fe58-4266-a4fc-c2919e313d9d_7ad634bd&bhcl_id=bff1f132-6356-4f44-b7d2-b13d4660ba1a_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n[Rippling](https://ste7galwmb2.typeform.com/to/OpiBm9ld/?utm_source=beehiiv&utm_medium=affiliate&utm_campaign=VPSLCCALRN&utm_term=CorpCampaign-SaaD&_bhiiv=opp_285d44e6-fe58-4266-a4fc-c2919e313d9d_7ad634bd&bhcl_id=bff1f132-6356-4f44-b7d2-b13d4660ba1a_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) is the cure. With one system of record, you can update employee data once,and it syncs everywhere: payroll, benefits, expenses, devices, and apps. \r\n\r\nLeaders gain real-time visibility. Teams regain lost hours. Employees get the seamless experience they deserve .\r\n\r\nThat?s why companies like Barry?s and Forterra turned to [Rippling](https://ste7galwmb2.typeform.com/to/OpiBm9ld/?utm_source=beehiiv&utm_medium=affiliate&utm_campaign=VPSLCCALRN&utm_term=CorpCampaign-SaaD&_bhiiv=opp_285d44e6-fe58-4266-a4fc-c2919e313d9d_7ad634bd&bhcl_id=bff1f132-6356-4f44-b7d2-b13d4660ba1a_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) ? to replace sprawl with speed and clarity.\r\n\r\nIt?s time to stop paying for inefficiency.\r\n\r\nDon?t get SaaD. Get Rippling.\r\n\r\n[Stop SaaD in its tracks](https://ste7galwmb2.typeform.com/to/OpiBm9ld/?utm_source=beehiiv&utm_medium=affiliate&utm_campaign=VPSLCCALRN&utm_term=CorpCampaign-SaaD&_bhiiv=opp_285d44e6-fe58-4266-a4fc-c2919e313d9d_7ad634bd&bhcl_id=bff1f132-6356-4f44-b7d2-b13d4660ba1a_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\nHey, this story is wild. Microsoft now owns 27% of OpenAI. Check the details below. \r\n\r\n# OpenAI Just Pulled Off the Richest Nonprofit Pivot in History\r\n\r\nListen, I need you to understand something wild that just happened: OpenAI?the company that started as a nonprofit promising to give AGI to all humanity?just completed one of the most consequential corporate restructurings in tech history. And it's basically a masterclass in having your cake, eating it, and convincing regulators you're still on a diet.\r\n\r\nHere's what went down on October 28th.\r\n\r\n## The Deal\r\n\r\nOpenAI is now split into two entities: a nonprofit \"Foundation\" and a for-profit public benefit corporation. The nonprofit holds 26% equity in a company now valued at $500 billion. Do the math?that's a $130 billion stake, making it one of the wealthiest philanthropic organizations ever created.\r\n\r\nMicrosoft? They got 27% for their $13.8 billion investment. That's a 10x return. Not bad for betting on the future of intelligence itself.\r\n\r\nBut here's the kicker: **the profit caps are completely gone.**\r\n\r\nRemember OpenAI's original promise? That investors would be capped at 100x returns, with excess profits flowing to humanity? That was the whole deal?the reason you could feel okay about a few VCs controlling AGI development. Yeah, that's dead now. Everyone holds regular equity that grows proportionally. The safety mechanism meant to protect against runaway investor influence was sacrificed to... satisfy investor demands.\r\n\r\n## What Microsoft Got\r\n\r\nThe partnership revision is equally insane:\r\n\r\n* IP rights to OpenAI's models through 2032 (including AGI)\r\n\r\n* Exclusive Azure API access until an independent panel verifies AGI exists\r\n\r\n* A 20% revenue share that continues until AGI verification\r\n\r\nIn exchange, Microsoft gave up its exclusive cloud computing rights (while OpenAI committed to $250 billion in Azure purchases anyway) and hardware IP rights.\r\n\r\nThe AGI verification mechanism is particularly clever?or dystopian, depending on your vibe. No more unilateral declarations. An expert panel has to confirm we've hit \"highly autonomous systems that outperform humans at most economically valuable work\" before the partnership terms change.\r\n\r\n## Why This Matters\r\n\r\nOpenAI projects spending $115 billion through 2029. Sam Altman announced plans for $1.4 trillion in computing infrastructure. This restructuring clears the path for an IPO?probably by 2027?because you can't raise that kind of money while capped-profit nonprofit subsidiaries lurk in your corporate structure.\r\n\r\nThe Foundation committed $25 billion to health research and AI safety work, which sounds great until you remember they're funding it by selling potentially trillion-dollar AGI rights at what critics call \"a massive discount.\"\r\n\r\nGeoffrey Hinton?the Nobel Prize-winning \"Godfather of AI\"?signed an open letter opposing this. Elon Musk is suing to unwind it. Public interest groups are calling the nonprofit's control \"illusory.\"\r\n\r\n**The thing is**: OpenAI might have just invented a new playbook for converting mission-driven organizations into investor-friendly vehicles while maintaining a philanthropic fig leaf. Call it \"non-profit washing.\" And if it works? Every ambitious nonprofit with valuable IP is going to study this structure very, very carefully.\r\n\r\nWelcome to the future, where the most important technology in human history is governed by a public benefit corporation with unenforceable purpose statements and a nonprofit that traded safety mechanisms for equity appreciation.\r\n\r\nWhat could go wrong?\r\n\r\n\r\n\r\n\r\n\r\nIncluding resources and direct links to sources affects email deliverability. If you ever want follow up sources or information from a issue just respond with the word **_Resources _**_and we?ll send them to you. _\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/microsoft-now-owns-27-of-openai-as-they-plan-their-ipo"
  }
]