[
  {
    "id": "199b678c667a401c",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "Bezos Says We're in a A.I Bubble",
    "date": "2025-10-05T22:23:11.000Z",
    "text": "### Trusted by millions. Actually enjoyed by them too. \r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/684b8bdd-9d73-4021-b88f-e0d0346a0c5f/Beehiiv_September_2025_1.png?t=1756834198)\r\nFollow image link: (https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_20e50f68-83ef-4d87-a7d7-8379adb251b5_fbd824b6&bhcl_id=b3fd9485-db68-493f-adcc-f7f643ab7737_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nMost business news feels like homework. [Morning Brew](https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_20e50f68-83ef-4d87-a7d7-8379adb251b5_fbd824b6&bhcl_id=b3fd9485-db68-493f-adcc-f7f643ab7737_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) feels like a cheat sheet. Quick hits on business, tech, and finance?sharp enough to make sense, snappy enough to make you smile.\r\n\r\n[Try the newsletter for free](https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_20e50f68-83ef-4d87-a7d7-8379adb251b5_fbd824b6&bhcl_id=b3fd9485-db68-493f-adcc-f7f643ab7737_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) and see why it?s the go-to for over 4 million professionals every morning. \r\n\r\n[Check it out](https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_20e50f68-83ef-4d87-a7d7-8379adb251b5_fbd824b6&bhcl_id=b3fd9485-db68-493f-adcc-f7f643ab7737_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n# Bezos Just Said What Everyone's Thinking: Yeah, We're in a Bubble\r\n\r\nJeff Bezos doesn't really sugarcoat things anymore. At a tech conference in Turin this past October, he basically stood up and said what most people have been whispering for months: we're absolutely in an AI bubble. Like, a massive one.\r\n\r\nBut here's where it gets interesting?he thinks that's actually okay. Maybe even good.\r\n\r\n**His argument? Not all bubbles are created equal.** Some bubbles pop and leave nothing but financial wreckage. Others pop and leave behind stuff that actually matters. Bezos calls these \"industrial bubbles,\" and he thinks AI falls into the second category.\r\n\r\n## When Your Stock Tanks But Your Business Doesn't: A Bezos Story\r\n\r\nLet's rewind to the dot-com crash for a second, because Bezos lived through the absolute worst of it. Amazon's stock went from $113 down to $6. Six dollars. And you know what the crazy part was? The company itself was actually doing _better_ during that time. Sales were up, the business was improving, but the stock price just cratered anyway.\r\n\r\n**That's what happens in a bubble.** The numbers stop making sense. Reality and valuation completely divorce from each other.\r\n\r\nFast forward to today, and look at what's happening with AI companies. OpenAI?which still isn't making a profit?just got valued at $500 billion in their latest funding round. That's up from $300 billion earlier this year. Employees sold $6.6 billion worth of stock to investors like SoftBank and some Abu Dhabi fund. These people are betting half a trillion dollars on potential, not on actual earnings.\r\n\r\nThe bigger picture is even wilder. AI startups pulled in $89.4 billion in venture capital money in 2025. That's 34% of all VC investment, even though AI companies only make up 18% of the total companies getting funded. In the US alone, private AI investment hit $109.1 billion last year?that's almost 12 times what China invested. Gartner's saying AI spending will hit around $1.5 trillion this year and over $2 trillion next year.\r\n\r\n**Those are bubble numbers.** When that much money chases that few opportunities, you know people are throwing cash at anything that moves. Good ideas, bad ideas, doesn't really matter?everyone's terrified of missing out.\r\n\r\n## Why Some Bubbles Actually Leave Good Stuff Behind\r\n\r\nSo here's Bezos's whole theory, and honestly it makes a lot of sense when you think about it. He says some bubbles?industrial ones?actually create real value even when investors get completely wrecked financially.\r\n\r\nHis example? The biotech boom in the 1990s.\r\n\r\n**That bubble was absolutely brutal for people who invested.** By 2004, public biotech companies had lost more than $40 billion combined. Tons of companies went under. A lot of wealthy people became significantly less wealthy. It was a bloodbath.\r\n\r\nBut you know what else came out of that period? Actual drugs that save actual lives. Between 1998 and 2008, biotech companies became responsible for almost half of all new drugs with completely novel mechanisms. They made 70% of orphan drugs?those rare disease treatments that big pharma wouldn't touch. Their share of blockbuster drugs jumped from 8% to 22% by 2007. And now the whole biotech industry grows at about 10% a year and saves countless lives every single day.\r\n\r\n**The money was lost, but the innovation stuck around.** The research happened. The knowledge got created. The drugs got developed. That infrastructure didn't just vanish when the stock prices crashed.\r\n\r\nThat's what Bezos means when he says: \"Industrial bubbles are not nearly as bad as financial bubbles, because when the dust settles and you see who the winners are, societies benefit from those inventions.\"\r\n\r\n## We've Seen This Movie Before (And We Know How It Ends)\r\n\r\nIf Bezos is right?and honestly, the guy's track record is pretty solid?then we're basically watching a rerun right now. Billions of dollars are getting thrown around recklessly, most of it will disappear, but the technology being built? That's probably here to stay.\r\n\r\nAll the warning signs from the biotech bubble are flashing again. Companies getting huge amounts of funding before they have real products? Check. Impossible to tell which companies will actually make it because everyone's so excited? Check. Long timelines before anyone knows if this stuff will actually work commercially? Check.\r\n\r\nEven Sam Altman from OpenAI admits it straight up: \"Are we in a phase where investors as a whole are overexcited about AI? My opinion is yes.\" The CEO of Goldman Sachs, David Solomon, warned that \"there will be a lot of capital that was deployed that didn't deliver returns\" and predicted a potential crash within 12-24 months.\r\n\r\n**They all see it coming.** Everyone with skin in the game knows there's going to be a reckoning. The question isn't if the bubble pops?it's what's still standing when it does.\r\n\r\nThere's some smart money making interesting bets though. BlackRock is trying to buy Aligned Data Centers for $40 billion, which would be one of the biggest deals this year. But notice what they're buying?not another AI model company, but the actual infrastructure. The plumbing. The stuff that doesn't go away when hype dies.\r\n\r\n## The Energy Problem Nobody Wants To Talk About\r\n\r\nHere's something that should probably worry people more than it does: these new AI data centers use 10 to 20 times more power than regular data centers. We're talking over 100 megawatts versus 5-10 megawatts.\r\n\r\n**That's not a small difference.** That's like comparing your house to a small town.\r\n\r\nThe forecasts are pretty alarming when you look at them. US data center power demand is supposed to more than double by 2035?going from 35 gigawatts in 2024 to 78 gigawatts. Between now and 2030, electricity demand for data centers is expected to increase by about 400 terawatt-hours, growing at 23% per year.\r\n\r\nGoldman Sachs figured out that we might need to spend about $720 billion on power grid upgrades just to support all these data centers. **That's three quarters of a trillion dollars just to keep everything running.**\r\n\r\nThis is where the rubber meets the road, right? You can build whatever AI system you want, but if you can't plug it in, it doesn't matter. And right now we're heading toward a situation where we might not have enough power to run everything people are building.\r\n\r\n## Space Data Centers: Billionaire Fantasy or Actual Future?\r\n\r\nWhich brings us to the most out-there thing Bezos said: he thinks we'll have gigawatt-scale data centers in space within 10-20 years.\r\n\r\n**I know, I know?it sounds completely insane.** Like something from a sci-fi movie where billionaires have lost touch with reality. But when you actually dig into the reasoning, it's... uncomfortably logical?\r\n\r\nThink about it: in space, you get constant solar power. Like 24/7, no clouds, no rain, no nighttime. The cooling situation is way better because space is already cold and you've got these extreme temperature swings you can use. There's no environmental rules about power usage or water consumption. And you can build massive facilities without worrying about where to put them on Earth.\r\n\r\n**The physics actually check out.** The problem has always been the cost and the logistics.\r\n\r\nBlue Origin already has this spacecraft platform called Blue Ring that launched back in October 2023. It's designed for \"in-space cloud computing\" along with hosting and moving stuff around. It can carry over 3,000 kilograms of equipment, has 12 docking ports, and the computing equipment is built to handle space radiation. Bezos literally calls it \"Amazon Web Services, but for space payload.\"\r\n\r\nAnd Blue Origin's New Glenn rocket?which had its first successful launch in January this year?can carry 45 metric tons to low Earth orbit. **The infrastructure is actually starting to exist.**\r\n\r\nBut let's be real about the problems. You'd need approximately 14,000 basketball court-sized heat sinks to cool a 1-gigawatt data center in space. Fixing things or upgrading equipment becomes way harder when it's in orbit. Launch costs are still massive even though they're dropping. And you need really fast, reliable connections back to Earth.\r\n\r\n## What 10-20 Years Actually Means\r\n\r\nWhen Bezos says 10-20 years, he's not just picking random numbers. **That's accounting for how long it takes to actually build this kind of infrastructure in space.** You need major breakthroughs in launch costs, figuring out how to maintain things in orbit, and getting energy where it needs to go.\r\n\r\nBut think about what that timeline means in practical terms. If he's right, we could see the first orbital data centers somewhere between 2035 and 2045. That's within the working lifetime of people who are just starting their careers right now. **This isn't some distant future thing?this is next generation planning.**\r\n\r\nBezos puts it in context with other space infrastructure: we already use space for weather satellites and communications satellites. \"The next step is data centers and then other forms of manufacturing,\" he says.\r\n\r\nIf this actually happens, the implications are huge. Blue Origin becomes a primary space trucking company. Amazon Web Services could extend into space. NVIDIA and other chip makers would need to make space-hardened equipment. Satellite communication companies would handle the data links. Aerospace manufacturers specializing in radiation-proof electronics would boom.\r\n\r\n**And traditional data center companies without a space strategy?** They could be in trouble once orbital options become cost-effective for certain types of work.\r\n\r\n## The Real Question: Who's Left Standing?\r\n\r\nHistory tells us most AI companies are going to fail. That's not being negative?that's just pattern recognition. The biotech bubble created lasting benefits, but most biotech companies didn't survive it. The dot-com crash gave us Amazon, Google, and modern internet commerce, but thousands and thousands of companies just vanished.\r\n\r\n**The AI bubble's going to follow the same path.** Bezos is pretty clear about this: investors are funding good and terrible ideas without much discrimination, everyone's too excited to tell the difference between winners and losers, and valuations have completely disconnected from business reality.\r\n\r\nBut here's what matters in the long run: the infrastructure being built doesn't disappear when the bubble pops. The trained models don't get untrained. The breakthroughs in understanding language and images don't get forgotten. Just like the biotech bubble left behind actual drugs and actual knowledge, the AI bubble will leave behind actual capabilities that work.\r\n\r\nThe survivors will probably be companies that either: have real revenue and sustainable businesses when the crash hits, control critical infrastructure that everyone needs regardless of hype, or achieve genuine breakthroughs that others can't easily copy.\r\n\r\n**OpenAI's $500 billion valuation makes them a fascinating test case.** They've got real technology and massive market presence, but they're not profitable yet. When things crash?and Bezos, Altman, and Solomon all basically say they will?will OpenAI's actual capabilities justify that price, or will they become the poster child for irrational exuberance?\r\n\r\n## Why This Matters Even If You're Not In Tech\r\n\r\nYou might be thinking, \"Okay, but I'm not a venture capitalist or an AI founder, so why should I care?\" **The answer is that when this bubble pops, it's going to reshape way more than just Silicon Valley.**\r\n\r\nThe companies that survive will probably dominate critical sectors for years. The infrastructure being built?from data centers to power grids to maybe even space facilities?will determine what's technologically possible for decades. The AI capabilities being developed will eventually spread throughout the entire economy, changing everything from healthcare to manufacturing to services.\r\n\r\nTiming really matters here too. If David Solomon's prediction is right about a crash in 12-24 months, we could see a major correction anywhere from late this year to mid-2027. That won't just hit AI startups?it'll ripple through the whole tech sector and probably broader markets too.\r\n\r\n**The energy infrastructure investments are happening no matter what.** That $720 billion in power grid spending represents real construction, real jobs, and real economic impact. The question is whether AI demand actually materializes enough to justify all of it, or whether we end up with a bunch of overcapacity.\r\n\r\nFor people working in tech, the bubble means opportunity and risk in equal measure. AI capabilities are being built at insane speed, which creates tons of demand for talent. But when the bubble bursts, a lot of those jobs disappear overnight. The trick is building skills that survive the shakeout?understanding fundamentals rather than whatever framework is hot this month.\r\n\r\n## The Uncomfortable Truth About Why Bubbles Might Be Necessary\r\n\r\nHere's something Bezos's framework forces us to think about: **maybe industrial bubbles are actually necessary for big technological shifts to happen.** If everyone invested carefully and rationally, maybe transformative technologies would develop too slowly or not at all.\r\n\r\nThe irrational exuberance, the FOMO-driven funding, the willingness to pour billions into completely unproven concepts?all of that accelerates development in ways that careful, conservative investment never could. Yeah, most investors lose money. Yeah, most companies fail. But the technology advances way faster than it otherwise would.\r\n\r\nThe biotech bubble produced life-saving drugs. The dot-com bubble produced the modern internet economy. The AI bubble, despite all its excess and the eventual crash, is producing genuine advances that will stick around.\r\n\r\n**Society benefits even when individual investors get crushed.** That's the core of what Bezos means by \"industrial bubble,\" and it actually helps make sense of what looks like collective insanity when you're in the middle of it.\r\n\r\n## After The Crash: What's Next?\r\n\r\nWhen the AI bubble eventually bursts?and based on what multiple industry leaders are saying, it's a matter of when not if?we'll move into a period where things consolidate and rationalize. **The survivors will be the ones with real technology advantages and business models that actually work.**\r\n\r\nThe infrastructure investments in power, data centers, and potentially space facilities will still be there. The trained models and knowledge will persist. The breakthroughs won't be unlearned. But the massive valuations disconnected from reality? Those will correct, and it'll be brutal when it happens.\r\n\r\nBezos's 10-20 year timeline for space data centers suggests he's thinking way beyond the immediate bubble cycle. Even if the AI bubble crashes in the next couple years, the underlying trajectory continues. The energy demands don't vanish?they might slow down, but the long-term trend toward needing more computing power is still there.\r\n\r\n**The space data center vision becomes way more compelling if we hit power constraints on Earth.** If ground-based infrastructure can't scale fast enough to meet AI's energy needs, orbital alternatives shift from sci-fi fantasy to economic necessity pretty quick.\r\n\r\n## Bottom Line: We're All Part of This Experiment Now\r\n\r\nBezos's take basically suggests we're living through a massive, messy, expensive experiment in how technology develops. **The AI bubble is real, the losses will be huge, but what comes out of it could be transformative.**\r\n\r\nFor investors, the message is pretty clear: most AI bets will fail spectacularly, but the winners will be enormous. For workers, the volatility is unavoidable?better to build skills that adapt. For society, the outcome depends on whether the AI capabilities being developed actually solve real problems or just automate away value without creating new value.\r\n\r\nThe space data center prediction adds another layer to all this: even the most established ways of doing things (like computing on the ground) might not survive the next few decades. **The people and companies that thrive will be the ones who can handle not just one big change but continuous transformation.**\r\n\r\nBezos isn't predicting disaster?he's predicting creative destruction on a massive scale, with AI as the catalyst and potentially space as the next frontier. Given his track record of seeing around corners before most people, that's probably worth paying attention to.\r\n\r\nThe bubble's here. The correction's coming. **And if Bezos is right, what emerges afterward might actually be worth all this chaos.**\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/bezos-says-we-re-in-a-a-i-bubble"
  }
]