[
  {
    "id": "199c101668b6dff9",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "The Wild A.I Stories You Missed This Last Week",
    "date": "2025-10-07T23:28:38.000Z",
    "text": "### We don?t do ?business as usual? \r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8cc5ddd0-7259-4903-9115-eb52c063256b/Beehiiv_September_2025_2.png?t=1756834137)\r\nFollow image link: (https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_b80d17b6-5ef9-4941-b745-c1bd7a55a1f0_fbd824b6&bhcl_id=590461e1-ca0b-4592-a0ab-427c8a5080dd_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nThe world moves fast, but understanding it shouldn?t be hard.\r\n\r\nThat?s why we created [Morning Brew](https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_b80d17b6-5ef9-4941-b745-c1bd7a55a1f0_fbd824b6&bhcl_id=590461e1-ca0b-4592-a0ab-427c8a5080dd_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492): a free, five-minute daily newsletter that makes business and finance news approachable?and even enjoyable. Whether it?s Wall Street, Silicon Valley, or what?s trending at the water cooler, the Brew serves up the context you need in plain English, with a side of humor to keep things interesting.\r\n\r\nThere?s a reason over 4 million professionals read the newsletter daily?and you can try it for free by clicking below! \r\n\r\n[Join 4M+ Readers Now](https://www.morningbrew.com/subscribe?utm_campaign=VPSLCCALRN&utm_medium=paid_newsletter&utm_source=beehiiv&_bhiiv=opp_b80d17b6-5ef9-4941-b745-c1bd7a55a1f0_fbd824b6&bhcl_id=590461e1-ca0b-4592-a0ab-427c8a5080dd_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n# The Great AI Gold Rush: What's Really Happening Behind the Billion-Dollar Deals\r\n\r\nThe past week has been absolutely wild for anyone watching the tech industry. We're not just seeing big numbers?we're watching companies bet their futures on a technology that's either going to transform everything or become the most expensive gamble in corporate history.\r\n\r\n## AMD Just Landed the Deal of a Lifetime (Maybe)\r\n\r\nHere's something that should make you do a double-take: AMD announced they're supplying OpenAI with hundreds of thousands of specialized chips over the next few years, starting in 2026. The kicker? This could bring in over $100 billion in revenue across four years (Reuters). That's not a typo.\r\n\r\nOpenAI sweetened the deal with a warrant that lets them buy up to 10% of AMD for basically nothing?one cent per share (Reuters). That's how badly they need these chips. Think about that dynamic for a second. OpenAI has so much leverage here that AMD essentially had to give them a piece of the company just to win the contract.\r\n\r\nThe scale is mind-boggling. These chips will consume about six gigawatts of power?enough electricity to run five million American homes (Reuters). Your entire neighborhood probably uses a fraction of that.\r\n\r\n**What this really means:** AMD is making a massive bet that they can compete with Nvidia, who's dominated this space. But here's the catch?most of AMD's chips are used for running models after they're trained, not for the heavy lifting of actually training them. If they can't prove they're competitive on training workloads, this deal might not be the game-changer it appears to be. And with OpenAI planning 16 gigawatts of total computing capacity that could cost up to $800 billion (Reuters), investors are basically betting that the demand will be there when the bills come due.\r\n\r\n## Everyone's Throwing Money at the Same Problem\r\n\r\nThe AMD deal wasn't happening in isolation. Early October saw what can only be described as a spending spree that would make even the wildest venture capitalists blush.\r\n\r\nNvidia's investing up to $100 billion in OpenAI. Meta signed a $14 billion deal with CoreWeave for computing power. Oracle is negotiating a $20 billion cloud deal with Meta and a separate $300 billion computing contract with OpenAI. Microsoft got $17.4 billion worth of capacity from Nebius Group. Google and Meta inked a cloud deal worth over $10 billion (Reuters).\r\n\r\nRead those numbers again. We're talking about deals that dwarf the GDP of entire countries.\r\n\r\n**The reality check:** This isn't normal business expansion. This is panic buying. Every major tech company is terrified of being left behind, so they're essentially pre-ordering computing capacity years in advance. It's like watching everyone rush to buy generators before a storm, except the generators cost billions and the storm might not even hit. If the demand doesn't materialize, someone's going to be holding some very expensive equipment.\r\n\r\n## OpenAI Wants to Be Your Operating System\r\n\r\nAt their Developer Day event on October 6th, OpenAI laid out an ambitious vision: they want ChatGPT to stop being just another app and become the layer that powers everything else (Reuters).\r\n\r\nThey announced partnerships with Spotify, Zillow, Mattel, and Figma to embed ChatGPT directly into their services. Imagine asking ChatGPT to find you a house or generate a playlist without ever leaving the chat interface. Mattel's even using OpenAI's Sora 2 video generator to turn toy sketches into polished videos (Reuters).\r\n\r\nCEO Sam Altman didn't sugarcoat things. He acknowledged the costs are astronomical and there might be a bubble forming, but insisted real value will emerge (Reuters).\r\n\r\n**Looking ahead:** If OpenAI succeeds, they won't just be a product?they'll be infrastructure. Think about how Google became synonymous with search or how AWS became the backbone of the internet. That's the play here. But becoming infrastructure means you need to be reliable, cheap, and indispensable. Right now, OpenAI is expensive and experimental. The gap between here and there is enormous.\r\n\r\n## IBM's Still in the Game (Seriously)\r\n\r\nWhile everyone's watching OpenAI and Anthropic, IBM quietly announced some serious enterprise products at their TechXchange conference in late September. They're launching Project Infragraph (coming to private beta in December 2025), which helps companies manage their computing workloads, and Project Bob, a development environment that works with models from Anthropic, Mistral, Meta's Llama, and IBM's own Granite family (StockTitan).\r\n\r\nThey also rolled out over 500 new tools and announced they're integrating Anthropic's Claude models into their products (StockTitan).\r\n\r\n**Why this matters:** IBM gets no love in the hype cycle, but they actually understand enterprise customers better than almost anyone. While startups are chasing consumer apps, IBM's building the boring stuff that big companies will actually pay for: management tools, compliance features, integration with existing systems. Don't sleep on the company that's been selling to enterprises for decades.\r\n\r\n## The Money's Flowing Like Water\r\n\r\nVenture capital investment jumped 38% year-over-year to $97 billion in Q3 2025. Nearly half of that?46%?went to companies working on this technology (Reuters).\r\n\r\nAnthropic alone raised $13 billion. Elon Musk's xAI grabbed $5.3 billion. French startup Mistral pulled in $2 billion (Reuters). U.S. companies captured $60 billion of global VC funding, while hardware companies (robotics, chips, quantum computing) attracted $16.2 billion (Reuters).\r\n\r\nEven smaller funds are getting in on the action. Seattle's AI2 Incubator announced an $80 million fund to back about 70 early-stage startups, investing up to $600,000 per company plus $1 million in cloud credits (GeekWire).\r\n\r\n**The uncomfortable truth:** This is what a bubble looks like when it's inflating. That doesn't mean it's going to pop tomorrow, but when 46% of all venture funding goes to one sector, you have to wonder what happens when the music stops. Nearly a quarter of AI2's portfolio companies have already been acquired and 90% have raised follow-on funding (GeekWire), which is either a sign of real success or just more money chasing the same idea.\r\n\r\n## Stargate: The Half-Trillion Dollar Bet\r\n\r\nHere's where things get truly ambitious. SoftBank and OpenAI are leading a consortium called Stargate that's planning to spend $500 billion to build about 10 gigawatts of data center capacity (Reuters).\r\n\r\nPartners include Oracle, Nvidia, Samsung, SK Hynix, Arm, Cisco, and others. Oracle's opening three new sites in Texas, New Mexico, and the Midwest. The Norway facility alone will get 100,000 Nvidia chips with room for a tenfold expansion (Reuters).\r\n\r\n**Let's be real:** This is one of the most audacious infrastructure projects in tech history. For context, $500 billion is roughly equal to the entire annual budget of the U.S. military. They're betting that demand for computing power will not just continue?it will explode. If they're right, Stargate becomes the backbone of the next computing era. If they're wrong, it becomes the most expensive white elephant ever built.\r\n\r\n## Microsoft Wants $20 a Month From You\r\n\r\nOn October 1st, Microsoft launched Microsoft 365 Premium for $19.99 per month, bundling their Copilot assistant across Outlook, Excel, and Word. You get features like \"Researcher\" and \"Analyst\" plus 1TB of storage (Reuters). They're discontinuing Copilot Pro and migrating those subscribers over.\r\n\r\n**The play here:** Microsoft's trying to normalize paying twenty bucks a month for what used to be included in your Office subscription. They're counting on people seeing enough value in the assistant features to justify the premium. The real test is whether these tools actually save people time or just become expensive novelties that sit unused.\r\n\r\n## Anthropic's Claude Gets a Major Upgrade\r\n\r\nOn September 29th, Anthropic released Claude 4.5 (Sonnet), which can now code autonomously for up to 30 hours?up from 7 hours previously (Reuters). It handles web app development and shows improvements in finance and scientific reasoning.\r\n\r\nMicrosoft's integrating Claude into its 365 Copilot and planning features like an office agent that can work across different apps (Reuters).\r\n\r\n**What's interesting:** Anthropic's focusing hard on business customers and emphasizing reliability and safety over pure capability. That's a smart positioning. While OpenAI chases consumer eyeballs, Anthropic's going after the customers who'll pay serious money for something they can trust. Corporate buyers care less about flashy demos and more about consistent performance and not getting sued.\r\n\r\n## China's Playing a Different Game\r\n\r\nChinese developer DeepSeek released an experimental model called V3.2-Exp that uses a clever technical approach to handle long documents while cutting computing costs. They slashed their pricing by over 50% (Reuters).\r\n\r\n**Why this matters:** While American companies are spending billions on bigger and more powerful systems, Chinese developers are figuring out how to do more with less. That's potentially a much more sustainable approach. If DeepSeek can deliver comparable capability at half the cost, suddenly all that American spending looks less like smart investment and more like brute force.\r\n\r\n## Dell's Having a Moment\r\n\r\nDell revised its four-year outlook on October 7th, now forecasting earnings growth of at least 15% (previously 8%) and revenue growth of 7-9%. The reason? Customers like xAI and CoreWeave are buying servers like crazy to power their computing workloads (Reuters).\r\n\r\n**The takeaway:** While everyone watches the software companies, the hardware suppliers are quietly printing money. Dell doesn't care if this is a bubble or the real deal?they get paid either way. That's actually the safest position to be in right now.\r\n\r\n## Meta's Going to Read Your Chats\r\n\r\nStarting December 16th, 2025, Meta will use conversations with its Meta AI assistant to personalize content and ads on Facebook and Instagram (everywhere except the EU, UK, and South Korea). You can't opt out if you use the assistant. They'll combine your chat history with your likes and follows to target content and ads, though they say they won't use sensitive topics like religion or health (Reuters).\r\n\r\n**The cynical view:** Meta has a billion monthly users on its assistant. That's a billion people generating data about their preferences, questions, and interests. From Meta's perspective, that's a goldmine. From a privacy perspective, it's another erosion of the line between conversation and surveillance. The fact that you can't opt out if you use the service tells you everything about how valuable Meta thinks this data is.\r\n\r\n## Nvidia's Taking a Stand on Immigration\r\n\r\nAfter former President Trump proposed a $100,000 fee for each new H-1B visa application, Nvidia CEO Jensen Huang told employees the company will keep sponsoring visas and cover the extra cost. He pointed out that half of the world's researchers in this field are Chinese (Reuters).\r\n\r\n**The bigger picture:** This technology is fundamentally global. The talent is global. The research is global. Any country that tries to wall itself off is going to fall behind. Nvidia understands that their success depends on being able to hire the best people regardless of where they're from. The willingness to eat a $100,000 per-person cost shows how serious they are about maintaining access to global talent.\r\n\r\n## The Economic Warning Signs\r\n\r\nMinneapolis Fed President Neel Kashkari said on October 7th that he doubts machines will rapidly replace workers, but warned that massive investment in data centers could keep borrowing costs high even if the Fed cuts rates. The logic: capital that would normally fund housing is flowing into data center construction instead (Reuters).\r\n\r\nMeanwhile, analysts are noting that spending on this technology now accounts for roughly one-third of recent U.S. GDP growth, even though it's only about 1% of the economy (Reuters). Citigroup forecasts that hyperscalers will invest $490 billion by 2026 and $2.8 trillion by 2029 (Reuters).\r\n\r\n**The uncomfortable question:** What happens if this doesn't work out? A lot of this spending is debt-financed. If the promised productivity gains don't materialize, if the applications don't justify the costs, if this turns out to be more hype than reality?well, someone's going to be left holding the bag. And given how much money is involved, the ripple effects could be significant.\r\n\r\n## Drug Companies Are Pooling Their Data (Kind of)\r\n\r\nBristol Myers Squibb, Takeda, Astex, AbbVie, and Johnson & Johnson announced a consortium on October 1st to train OpenFold3, a model for predicting how small molecules bind to proteins. They're using federated learning through a startup called Apheris, meaning the data stays within each company but the model learns from all of them (Reuters).\r\n\r\n**Why this is fascinating:** Drug companies are notoriously secretive. The fact that competitors are willing to collaborate?even with safeguards?shows how seriously they're taking this technology's potential. If it works, it could dramatically speed up drug discovery. If it becomes the standard approach, it could reshape how pharmaceutical research happens.\r\n\r\n## The Bottom Line\r\n\r\nLook, we're watching something historic unfold. The amounts of money being committed are staggering. The ambitions are enormous. The potential is real.\r\n\r\nBut let's be honest about what's happening. This is a land grab. Every major company is terrified of missing out on what could be the biggest technological shift since the internet. So they're spending money they might not have on capacity they might not need for applications that might not exist.\r\n\r\nSome of this will work out spectacularly. Some of it will be studied in business schools as a cautionary tale. The hard part is figuring out which is which while it's happening.\r\n\r\nThe market hit record highs when the AMD-OpenAI deal was announced (Reuters), but analysts warned that enthusiasm may fade \"when waves eventually crest.\" That's probably the most honest assessment: we're riding a wave right now, and it feels incredible. But waves don't go up forever.\r\n\r\nThe question isn't whether this technology is real?it clearly is. The question is whether the current level of investment matches the actual near-term value that will be created. And honestly, nobody knows the answer to that yet.\r\n\r\nWhat we do know is that we're living through a moment that will be written about for decades. Whether it's remembered as the dawn of a new era or as a spectacular example of irrational exuberance depends on what happens next.\r\n\r\nPlace your bets accordingly.\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/the-wild-a-i-stories-you-missed-this-last-week"
  }
]