[
  {
    "id": "19a098b7af7875ba",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "Google Drops Privacy, ChatGPT's Fall, and Nvidia's Homecoming",
    "date": "2025-10-22T01:32:06.000Z",
    "text": "### The Gold standard for AI news\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/90b995bd-d2c2-419e-bdd7-fd452c09b81f/Get_the_AI_news_that_matters_No_hype__just_facts_v1.jpg?t=1756241854)\r\nFollow image link: (https://magic.beehiiv.com/v1/faa6a747-8c1c-43c1-8155-91aa43268f01?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fwww.superhuman.ai%2Fc%2Fconfirmation%3Fmagiclink_subscription&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_25a866ab-463b-49e9-9783-4839804b133a_d22f5b49&bhcl_id=fa87312c-c8a0-48ed-8a5a-145a271512c3_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nAI keeps coming up at work, but you still don't get it? \r\n\r\nThat's exactly why 1M+ professionals working at Google, Meta, and OpenAI read [Superhuman AI](https://magic.beehiiv.com/v1/faa6a747-8c1c-43c1-8155-91aa43268f01?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fwww.superhuman.ai%2Fc%2Fconfirmation%3Fmagiclink_subscription&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_25a866ab-463b-49e9-9783-4839804b133a_d22f5b49&bhcl_id=fa87312c-c8a0-48ed-8a5a-145a271512c3_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) daily. \r\n\r\nHere's what you get:\r\n\r\n* Daily AI news that matters for your career - Filtered from 1000s of sources so you know what affects your industry.\r\n\r\n* Step-by-step tutorials you can use immediately - Real prompts and workflows that solve actual business problems.\r\n\r\n* New AI tools tested and reviewed - We try everything to deliver tools that drive real results.\r\n\r\n* All in just 3 minutes a day\r\n\r\n[Join 1M+ pros](https://magic.beehiiv.com/v1/faa6a747-8c1c-43c1-8155-91aa43268f01?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fwww.superhuman.ai%2Fc%2Fconfirmation%3Fmagiclink_subscription&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_25a866ab-463b-49e9-9783-4839804b133a_d22f5b49&bhcl_id=fa87312c-c8a0-48ed-8a5a-145a271512c3_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n# When Giants Stumble: \r\n\r\n**TLDR:** Google just killed the thing it spent six years building to save the internet. ChatGPT's growth is doing that thing where it stops going up and to the right. And Nvidia is making chips in America again, which is either a triumph of industrial policy or a very expensive insurance policy. Let's break down what the hell is actually happening.\r\n\r\n???????????????????????????\r\n\r\n## Google Blinks\r\n\r\nHere's the thing about Privacy Sandbox: it was always a Rube Goldberg machine designed to solve a problem Google created in the first place.\r\n\r\nFor those who missed the saga, Privacy Sandbox was Google's grand plan to kill third-party cookies?those little tracking files that follow you around the internet like a desperate ex?while still keeping the $200+ billion advertising engine humming. Launched in 2019, the idea was to replace individual tracking with group-based targeting. Instead of knowing _you_ looked at running shoes, advertisers would know \"Person in Cohort 847\" did. Privacy preserved, ads still work, everyone's happy.\r\n\r\nExcept nobody was happy.\r\n\r\nIn October 2025, Google officially pulled the plug. Privacy Sandbox is dead. The FLoC (Federated Learning of Cohorts) thing? Gone. Topics API? Shelved. All those acronym-soup replacement technologies? Being \"absorbed into broader Chrome Privacy features,\" which is corporate speak for \"we're putting this in a drawer and never opening it again.\"\r\n\r\n**Why does this matter?**\r\n\r\nBecause this wasn't just a product failure?it was a political and economic retreat on multiple fronts simultaneously.\r\n\r\nFirst, the economics were brutal. When GroupM, Publicis, and Omnicom actually tested Sandbox-based targeting, they found click-through rates and cost-per-click metrics were **25-40% weaker** than good old-fashioned cookies. Google's own internal tests showed CPM losses up to 40% in some ad formats. The Trade Desk, Criteo, Amazon Advertising?basically everyone who matters in digital advertising?looked at Privacy Sandbox and said \"yeah, we're good with cookies, thanks.\"\r\n\r\nListen, when you're Google and you build something to replace the foundation of your business model, and literally nobody wants to use it because it makes them less money, you have a problem.\r\n\r\nSecond, the regulatory situation was a nightmare. The UK's Competition and Markets Authority had been breathing down Google's neck since 2021, forcing cookie deprecation delays. The EU's Digital Markets Act wanted transparency and user opt-in, which fundamentally contradicted how Sandbox worked by default. Google was trying to thread a needle between \"privacy-conscious enough to satisfy regulators\" and \"effective enough to satisfy advertisers\" and discovered the needle's eye didn't actually exist.\r\n\r\nThird?and this is the kicker?Google's Ads division basically staged an internal coup. When A/B testing showed **17% of ad spend migrating to competitors** during Sandbox-only runs, the finance and product teams said \"absolutely not\" and killed the whole thing.\r\n\r\n**Here's what actually happened:** Google spent six years building elaborate technical infrastructure to appear like they were taking privacy seriously, burned through god-knows-how-much engineering talent and political capital, pissed off both privacy advocates AND advertisers, and ended up right back where they started?with third-party cookies and a new \"Privacy and Ads Settings\" dashboard that basically amounts to a prettier consent form.\r\n\r\nThe Privacy Sandbox staff? Reassigned. The code? Buried in experimental flags. The vision? Dead.\r\n\r\nWhat we're left with is Google, Meta, Amazon, and everyone else back on the same page: traditional tracking methods, wrapped in just enough user-choice language to keep regulators at bay. The Electronic Frontier Foundation called it \"surveillance infrastructure wrapped in standardization,\" and honestly, they weren't wrong.\r\n\r\nThe broader implication here is that meaningful privacy reform in digital advertising is essentially impossible when it's left to the companies profiting from surveillance. Google tried to have it both ways and discovered you actually can't. So they chose money. Shocker.\r\n\r\n???????????????????????????\r\n\r\n## ChatGPT Grows Up (And Slows Down)\r\n\r\nRemember when ChatGPT was the fastest-growing consumer app in history? Yeah, that party's over.\r\n\r\nThe numbers tell the story: ChatGPT peaked at around **182 million daily active users** in June 2025. By October, downloads were down 8-10% month-over-month, time spent per user dropped 22.5%, and sessions per user fell 20.7%. The hockey stick broke.\r\n\r\nNow, before you write OpenAI's obituary, let's be clear about what's actually happening here. This isn't a collapse?it's normalization. And it reveals something fundamental about how AI adoption actually works versus how we thought it would work.\r\n\r\n**The novelty effect is real, and it's powerful, and it doesn't last.**\r\n\r\nEveryone who was curious about AI chatbots tried ChatGPT in the first half of 2025. They asked it to write poems, explain quantum physics, help with homework, generate code. Some of those people found genuine use cases and stuck around. Most didn't. That's not a failure?that's just how consumer technology diffusion works.\r\n\r\nWhat's more interesting is the fragmentation. Claude 3.5, Gemini 1.5 Pro, Meta's Llama-powered assistants, Perplexity?the AI chat landscape went from one player to half a dozen credible alternatives in basically six months. Attention got distributed. That was inevitable once the technology itself became commoditized enough that execution and integration mattered more than pure capability.\r\n\r\nBut here's where OpenAI is actually playing this smart: they pivoted to _revenue quality_ over user growth. Premium subscribers?about 16% of the active base?now generate roughly **75% of ChatGPT's mobile app revenue**. Revenue per user climbed 13% in Q3 even as total users flatlined.\r\n\r\nOpenAI is betting on the enterprise and professional segments: ChatGPT Team for SMBs, ChatGPT Enterprise for corporate deployments, custom GPT storefronts. They're moving up-market, where the money actually is. PwC, Bain, Klarna, Bloomberg?these aren't casual users checking if AI can write their Tinder bios. These are organizations integrating AI into workflows and paying real money for reliability, privacy controls, and support.\r\n\r\nThe geographic split is telling too. Asia-Pacific, especially India, is still growing?17% year-over-year usage increases. But that's largely driven by lower subscription penetration and different use patterns. In the U.S. and Europe, the market is maturing: fewer 18-24-year-olds just messing around, more 35-50-year-old professionals using it for actual work.\r\n\r\n**What does this tell us about AI adoption more broadly?**\r\n\r\nWe're in the \"trough of disillusionment\" phase, but not in a bad way. The people who are still using ChatGPT (and Claude, and Gemini) are the ones who found genuine utility. The casual experimenters moved on. That's healthy. That's how technologies go from toys to tools.\r\n\r\nThe real action is shifting to _embedded AI_?the custom GPTs, the API integrations, the agent-based workflows built into existing software. Less time in the ChatGPT interface itself, more AI functionality baked into the apps people already use. Microsoft Copilot in Office. Claude in developer tools. Perplexity for search.\r\n\r\nChatGPT's slowdown isn't a sign that AI isn't working. It's a sign that AI is working well enough to become infrastructure. You don't need to go to [ChatGPT.com](https://ChatGPT.com) anymore because AI capabilities are increasingly wherever you already are.\r\n\r\nThat's not a problem for OpenAI. That's the entire point.\r\n\r\n???????????????????????????\r\n\r\n## Nvidia's All-American Manufacturing Moment\r\n\r\nFor the first time in almost a decade, Nvidia is making high-performance GPUs on U.S. soil. Specifically, they're cranking out Blackwell architecture chips?the B100 and B200 models?at TSMC's Arizona facility using a 4-nanometer process node.\r\n\r\nThis is being hailed as a symbolic milestone, a triumph of the CHIPS and Science Act, a strategic masterstroke. And sure, yeah, fine. But let's talk about what this actually means beyond the press releases and ribbon-cutting ceremonies.\r\n\r\n**First, the basics:** TSMC's Phoenix plant is producing roughly **30,000 wafers per month** of Nvidia chips, with packaging handled by Amkor Technology and Siliconware at nearby Arizona facilities. Final assembly happens at new Nvidia sites in Austin and Dallas-Fort Worth. The entire operation is supported by about $1.2 billion in CHIPS Act incentives, split across the partners involved, and is expected to create around 8,000 jobs directly and indirectly.\r\n\r\nNow here's the thing?the Arizona chips are using N4P, which is a _trailing-edge_ process node compared to TSMC's N3E tech used for cutting-edge stuff like Apple's A18 chips. This isn't about making the absolute best, most advanced chips on Earth. This is about **volume, resilience, and political positioning**.\r\n\r\nWhy does Nvidia care about making chips in America when Taiwan has been perfectly fine for years?\r\n\r\nThree reasons, and they're all practical:\r\n\r\n**1. Geopolitical risk is real.** Taiwan is 100 miles from China. If things go sideways, Nvidia's entire supply chain could evaporate overnight. Diversifying production to the U.S. is expensive insurance against the worst-case scenario. When you're the most valuable chip company on the planet and your customers include AWS, Microsoft, and the Pentagon, you pay for redundancy.\r\n\r\n**2. Government contracts require it.** If you want to sell high-performance computing hardware to U.S. defense agencies, national labs, and government cloud infrastructure, increasingly you need to prove supply chain traceability. \"Made in Taiwan\" doesn't cut it when you're dealing with classified systems. U.S. production checks that box.\r\n\r\n**3. The politics of the CHIPS Act.** Nvidia got $1.2 billion in subsidies for this. That's not just free money?it's a down payment on favorable treatment as Congress and regulators think about AI chip monopolies, export controls to China, and industrial policy. Nvidia is signaling they're Team America. That matters when antitrust reviews are ongoing and export rules keep tightening.\r\n\r\n**Is this actually a big deal for supply volume?**\r\n\r\nNot really. The Arizona output supplements, it doesn't replace, TSMC's Taiwan production. This is symbolic capacity. Nvidia will still make the vast majority of its chips in Taiwan because that's where the most advanced nodes and highest yields are. But now they have optionality. Now they can tell hyperscalers and government clients \"we can guarantee domestic supply if you need it.\"\r\n\r\nAMD and Intel are both chasing AI chip market share, with competing products launching in 2026. Nvidia's early move on U.S. manufacturing gives them a first-mover advantage in the \"patriotic AI hardware\" positioning game, which is increasingly what matters for landing massive government and regulated-industry contracts.\r\n\r\n**The broader context:** This is part of a much larger story about semiconductor supply chain re-regionalization. The CHIPS Act is basically the U.S. government spending $280 billion to say \"we fucked up by offshoring all this critical infrastructure, let's fix it before it becomes a national security crisis.\"\r\n\r\nIs it working? Sort of. We're getting fabs built. We're getting jobs created. But we're still years behind Taiwan and Korea in advanced manufacturing expertise. And the costs are astronomical?building semiconductor capacity in the U.S. is roughly 50% more expensive than in Asia due to labor, regulatory compliance, and construction costs.\r\n\r\nNvidia's Arizona chips will probably cost more per unit to produce than their Taiwan equivalents. But for customers who need guaranteed supply, regulatory compliance, or just the warm fuzzy feeling of \"Made in USA,\" that premium is worth it.\r\n\r\nThis is what deglobalization looks like in practice: more expensive, less efficient, but more resilient. Whether that trade-off makes sense depends entirely on whether you think geopolitical stability is going to hold or fracture over the next decade.\r\n\r\nNvidia is betting on fracture. Given the world right now, that's probably smart.\r\n\r\n???????????????????????????\r\n\r\n## What This All Means\r\n\r\nThree stories, three very different outcomes, but they're all about the same thing: **strategic retreat in the face of reality**.\r\n\r\nGoogle retreated from its privacy gambit because the economics and politics didn't work. They chose revenue preservation over principled reform. Fair enough?they're a publicly traded company, not a nonprofit.\r\n\r\nChatGPT retreated from hyper-growth expectations because early adoption doesn't equal sustained engagement. They're pivoting to monetization depth instead of user breadth, which is the mature move. The gold rush phase is over; now it's about building actual businesses.\r\n\r\nNvidia retreated from pure efficiency by bringing production to the U.S., accepting higher costs and lower yields in exchange for supply chain resilience and political favor. In a fragmented geopolitical environment, that's not weakness?that's adaptation.\r\n\r\nThe common thread is that reality always wins. Google couldn't legislate away the fundamental tension between privacy and advertising. OpenAI couldn't keep exponential growth going forever. Nvidia couldn't ignore supply chain risk just because Taiwan has the best fabs.\r\n\r\nAnd honestly? That's fine. The hype cycles are giving way to the actual work of building sustainable businesses, navigating regulations, managing risks. It's less exciting than the \"move fast and break things\" era, but it's probably healthier.\r\n\r\nWe're in the consolidation phase of a lot of different tech narratives simultaneously. The question now isn't \"what's the next big thing\" but \"how do we make the current big things actually work.\"\r\n\r\nLess revolutionary. More incremental. Still interesting as hell if you're paying attention.\r\n\r\n???????????????????????????\r\n\r\n**Links and Thoughts:**\r\n\r\n* The Privacy Sandbox story is basically a case study in how hard it is to reform systems you profit from. Google tried to have their cake and eat it too, and discovered the cake was a lie.\r\n\r\n* For more on AI adoption curves and normalization, the analogy to mobile app growth circa 2012 is actually pretty apt. We went from \"holy shit, apps\" to \"apps are just how software works now\" in about 18 months. Same thing is happening with AI.\r\n\r\n* The semiconductor reshoring story is going to define the next decade of tech infrastructure. Pay attention to where chips are made, who's making them, and what governments are subsidizing. It matters more than most of the software-layer stuff we obsess over.\r\n\r\n* If you're building in AI right now, the ChatGPT plateau is good news. It means the territory is opening up. Dominance isn't locked in. There's room for different approaches, better UX, specialized tools. The land grab is over; now we build actual products.\r\n\r\nStay curious. Stay skeptical. See you next time.\r\n\r\nGoogle Privacy Sandbox Shutdown Sources\r\n\r\n1. Google official Privacy Sandbox announcement - update on plans and retirement of APIs:\r\n**[https://privacysandbox.com/news/update-on-plans-for-privacy-sandbox-technologies/](https://privacysandbox.com/news/update-on-plans-for-privacy-sandbox-technologies/)** (Oct 16, 2025)?\r\n\r\n2. AdWeek article: \"Google's Privacy Sandbox Is Officially Dead\" ? overview of shutdown and confirmed retirement by Google spokesperson:\r\n**[https://www.adweek.com/media/googles-privacy-sandbox-is-officially-dead/](https://www.adweek.com/media/googles-privacy-sandbox-is-officially-dead/)** (Oct 17, 2025)?\r\n\r\n3. Engadget report: \"Google has killed Privacy Sandbox,\" including regulatory context and company quotes:\r\n**[https://www.engadget.com/cybersecurity/google-has-killed-privacy-sandbox-130029899.html](https://www.engadget.com/cybersecurity/google-has-killed-privacy-sandbox-130029899.html)** (Oct 18, 2025)?\r\n\r\n4. Times of India coverage: \"Google kills its six-year-old project, Privacy Sandbox\" ? regulatory scrutiny and adoption issues:\r\n**[https://timesofindia.indiatimes.com/technology/tech-news/google-kills-its-six-year-old-project-privacy-sandbox/articleshow/124694127.cms](https://timesofindia.indiatimes.com/technology/tech-news/google-kills-its-six-year-old-project-privacy-sandbox/articleshow/124694127.cms)** (Oct 19, 2025)?\r\n\r\n5. Gizmodo analysis: \"Google's Ambitious Privacy Sandbox Project Signals Its End\" ? implications for web privacy and ad tracking:\r\n**[https://gizmodo.com/google-anti-cookie-project-is-dead-2000674031](https://gizmodo.com/google-anti-cookie-project-is-dead-2000674031)** (Oct 18, 2025)?\r\n\r\n6. Forbes article: \"'Phased Out'?Google Confirms Bad News For All 3 Billion Chrome Users\" ? user and market impact analysis:\r\n**[https://www.forbes.com/sites/zakdoffman/2025/10/19/phased-out-google-confirms-bad-news-for-all-3-billion-chrome-users/](https://www.forbes.com/sites/zakdoffman/2025/10/19/phased-out-google-confirms-bad-news-for-all-3-billion-chrome-users/)** (Oct 19, 2025)?\r\nand a follow-up update:\r\n**[https://www.forbes.com/sites/zakdoffman/2025/10/21/phased-out-google-confirms-bad-news-for-all-3-billion-chrome-users/](https://www.forbes.com/sites/zakdoffman/2025/10/21/phased-out-google-confirms-bad-news-for-all-3-billion-chrome-users/)** (Oct 21, 2025)?\r\n\r\n7. Ghacks technical overview on ended APIs and remaining supported ones:\r\n**[https://www.ghacks.net/2025/10/20/google-announces-end-of-many-of-its-privaxy-sandbox-technologies/](https://www.ghacks.net/2025/10/20/google-announces-end-of-many-of-its-privaxy-sandbox-technologies/)** (Oct 20, 2025)?\r\n\r\n8. Additional coverage: \"Google Officially Shuts Down Privacy Sandbox, Ending Cookie Replacement Effort\"\r\n**[https://somoshermanos.mx/google-officially-shuts-down-privacy-sandbox-ending-cookie-replacement-effort/](https://somoshermanos.mx/google-officially-shuts-down-privacy-sandbox-ending-cookie-replacement-effort/)** (Oct 19, 2025)?\r\n\r\n9. Yahoo/ATT brief article: \"Google's Privacy Sandbox Is Officially Dead\"\r\n**[https://currently.att.yahoo.com/att/googles-privacy-sandbox-officially-dead-143624466.html](https://currently.att.yahoo.com/att/googles-privacy-sandbox-officially-dead-143624466.html)** (Oct 2025)?\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/google-drops-privacy-chatgpt-s-fall-and-nvidia-s-homecoming"
  },
  {
    "id": "19a08cd6cddd0cc5",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "The $200M reason Apple keeps losing its best AI researchers",
    "date": "2025-10-21T22:04:31.000Z",
    "text": "### The Tech newsletter for Engineers who want to stay ahead\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/67300775-7738-44d1-a246-dd3e5c0d1713/The_Morning_Paper_for_AI___ML_Engineers_V2__1_.jpg?t=1759254145)\r\nFollow image link: (https://magic.beehiiv.com/v1/5f7ce6e3-9a71-416b-99a7-606c5f7e2447?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fcodenewsletter.ai%2Fforms%2F14166360-de71-46c4-8722-878d417fab5c&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_a0dce976-b256-4f6d-8fd1-d37f8a94c9d7_94e90c2e&bhcl_id=159b2da4-b51d-44a2-b047-e1f242a9eefa_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nTech moves fast, but you're still playing catch-up?\r\n\r\nThat's exactly why 100K+ engineers working at Google, Meta, and Apple read [The Code](https://magic.beehiiv.com/v1/5f7ce6e3-9a71-416b-99a7-606c5f7e2447?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fcodenewsletter.ai%2Fforms%2F14166360-de71-46c4-8722-878d417fab5c&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_a0dce976-b256-4f6d-8fd1-d37f8a94c9d7_94e90c2e&bhcl_id=159b2da4-b51d-44a2-b047-e1f242a9eefa_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) twice a week.\r\n\r\nHere's what you get:\r\n\r\n* Curated tech news that shapes your career - Filtered from thousands of sources so you know what's coming 6 months early.\r\n\r\n* Practical resources you can use immediately - Real tutorials and tools that solve actual engineering problems.\r\n\r\n* Research papers and insights decoded - We break down complex tech so you understand what matters.\r\n\r\nAll delivered twice a week in just 2 short emails.\r\n\r\n[Join 100K+ engineers](https://magic.beehiiv.com/v1/5f7ce6e3-9a71-416b-99a7-606c5f7e2447?email=themnewsandstuff@gmail.com&redirect_to=https%3A%2F%2Fcodenewsletter.ai%2Fforms%2F14166360-de71-46c4-8722-878d417fab5c&utm_source=beehiiv&utm_campaign=VPSLCCALRN&redirect_delay=3&_bhiiv=opp_a0dce976-b256-4f6d-8fd1-d37f8a94c9d7_94e90c2e&bhcl_id=159b2da4-b51d-44a2-b047-e1f242a9eefa_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n# Apple's AI Brain Drain: When Your Best People Jump Ship Right After Getting Promoted\r\n\r\nListen, when your newly minted team lead quits _weeks_ after the promotion, that's not just bad?it's a five-alarm fire about what's happening inside the building.\r\n\r\nKe Yang just left Apple for Meta. The kicker? He'd literally just been promoted to run the AKI team?the group building the new Siri that's supposed to finally make Apple's voice assistant not suck. We're talking about the ChatGPT-style \"answer engine\" that was supposed to launch in March 2026 and save Apple from becoming the company that slept through the AI revolution.\r\n\r\nYang wasn't some middle manager. This is a Carnegie Mellon grad who spent over a decade at Google Brain, helped build TensorFlow, and was considered the most prominent executive on Apple's Siri overhaul. The guy reported directly to John Giannandrea, Apple's AI chief. And he bailed.\r\n\r\n## The Exodus Isn't Slowing Down\r\n\r\nHere's what should terrify Apple shareholders: Yang is just the latest. At least 12-15 members of Apple's Foundation Models team?the core group building Apple Intelligence?have fled to competitors in the past year. Ruoming Pang, the founder of Apple's Foundation Models team, left for Meta with a compensation package reportedly worth $200 million. Frank Chu, who managed LLM training infrastructure, went to Meta's AI labs. Tom Gunter, Mark Lee, Chong Wang?all gone to Meta.\r\n\r\nWhen your talent pipeline looks like a fire exit during an earthquake, you don't have a retention problem. You have a _why the hell would anyone stay_ problem.\r\n\r\n## Meta's Buying Spree\r\n\r\nWhere's everyone going? Meta Superintelligence Labs, a division launched after Meta dropped $14.3 billion for 49% of Scale AI and brought on its 28-year-old founder Alexandr Wang to lead the charge toward AGI. Zuckerberg's not being subtle: \"I'm focused on building the most elite and talent-dense team in the industry for our superintelligence effort.\"\r\n\r\nMeta's offering stupid money?packages ranging from tens of millions to $200 million annually?and assembling a dream team: 44+ top researchers, 75% with PhDs, 40% poached from OpenAI, 20% from DeepMind. They're building toward \"personal superintelligence\"?AI that knows you, anticipates your needs, and acts autonomously on your behalf through devices like Meta's Ray-Ban AI glasses.\r\n\r\n## Meanwhile, NVIDIA's Playing a Different Game\r\n\r\nWhile Apple and Meta fight over talent, NVIDIA's out here giving away the entire playbook. Their \"AI cookbook\" isn't just model weights?it's training datasets, synthetic data techniques, precision algorithms, the works. NVIDIA's VP of Generative AI, Kari Briski, explained it simply: when the community collaborates openly, everyone moves faster.\r\n\r\nThe crown jewel? Isaac GR00T N1, the world's first open humanoid reasoning model. It uses a dual-system architecture?fast reflexes plus slow deliberate thinking?and NVIDIA generated 780,000 synthetic training trajectories in 11 hours using their physics simulator. That's 6,500 hours of human demonstration compressed into half a day. Companies like Boston Dynamics and Figure AI already have early access. Even Disney's using it for theme park robots.\r\n\r\n## What This Actually Means\r\n\r\nApple's losing the people who know how to build the future while trying to ship a Siri update that's already 15 years late to being good. Meta's hoarding elite talent to chase superintelligence. NVIDIA's open-sourcing everything because they've realized the real money is selling the shovels?their GPUs power everyone's AI dreams regardless of who wins the model wars.\r\n\r\nThe question isn't whether Apple can catch up in AI. It's whether they can stop the bleeding long enough to finish what they started.\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/the-200m-reason-apple-keeps-losing-its-best-ai-researchers"
  }
]