[
  {
    "id": "19a37f6fe23e26e5",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "NVIDIA CEO We're Not in A Bubble | OpenAI To Go Public",
    "date": "2025-10-31T01:52:03.000Z",
    "text": "### Introducing the first AI-native CRM\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/9f500bb4-baea-4635-9dc0-99096c5a2b26/beehiiv.png?t=1750705249)\r\nFollow image link: (https://attio.com?utm_source=beehiiv&utm_medium=newsletter_sponsorship&utm_campaign=beehiiv-Q4Y25&utm_content=VPSLCCALRN&_bhiiv=opp_ee1a52d0-80a9-4859-a239-24e42bd05a5d_f1be5357&bhcl_id=299f2ad8-d19c-486c-a208-30efae987218_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\n[Connect your email](https://attio.com?utm_source=beehiiv&utm_medium=newsletter_sponsorship&utm_campaign=beehiiv-Q4Y25&utm_content=VPSLCCALRN&_bhiiv=opp_ee1a52d0-80a9-4859-a239-24e42bd05a5d_f1be5357&bhcl_id=299f2ad8-d19c-486c-a208-30efae987218_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492), and you?ll instantly get a CRM with enriched customer insights and a platform that grows with your business.\r\n\r\nWith AI at the core, [Attio](https://attio.com?utm_source=beehiiv&utm_medium=newsletter_sponsorship&utm_campaign=beehiiv-Q4Y25&utm_content=VPSLCCALRN&_bhiiv=opp_ee1a52d0-80a9-4859-a239-24e42bd05a5d_f1be5357&bhcl_id=299f2ad8-d19c-486c-a208-30efae987218_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) lets you:\r\n\r\n* Prospect and route leads with research agents\r\n\r\n* Get real-time insights during customer calls\r\n\r\n* Build powerful automations for your complex workflows\r\n\r\nJoin industry leaders like Granola, Taskrabbit, Flatfile and more.\r\n\r\n[?Try Attio Pro for free](https://attio.com?utm_source=beehiiv&utm_medium=newsletter_sponsorship&utm_campaign=beehiiv-Q4Y25&utm_content=VPSLCCALRN&_bhiiv=opp_ee1a52d0-80a9-4859-a239-24e42bd05a5d_f1be5357&bhcl_id=299f2ad8-d19c-486c-a208-30efae987218_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\nHey, josh here. Check this story out. NVIDIA CEO says we aren?t in a bubble all while OpenAI is set to go public.  \r\n\r\n# OpenAI's Trillion-Dollar Bet: Why Going Public Changes Everything\r\n\r\nListen, we need to talk about what's happening with OpenAI. Because the company that gave us ChatGPT?the one that's been burning through cash like it's going out of style?is preparing to do something that could reshape the entire AI landscape: go public.\r\n\r\n## The Numbers Are Insane\r\n\r\nHere's what we know. OpenAI is eyeing an IPO that could value the company at **$1 trillion**. Not million. Not billion. _Trillion_. With a T. They're reportedly looking to file with regulators as early as late 2026, with CFO Sarah Friar targeting a 2027 listing. And get this?early discussions involve raising around $60 billion in the IPO itself.\r\n\r\nTo put that in perspective: OpenAI's current revenue run-rate is about $20 billion. They're losing tens of billions of dollars. And they're still talking about a trillion-dollar valuation. What is going on?\r\n\r\n## The Real Story: It's All About Compute\r\n\r\nThe thing is, Sam Altman has been remarkably candid about why this matters. \"Everything starts with compute,\" he's said. And he's not kidding around. OpenAI is spending somewhere in the ballpark of $60 billion _per year_ on cloud computing with Oracle. They've committed $18 billion to an OpenAI-Oracle data center joint venture. Another $10 billion on custom silicon. Oh, and NVIDIA just agreed to invest up to $100 billion and supply cutting-edge GPUs.\r\n\r\nThis is the game: whoever controls the compute wins the AI race. It's like the oil rush, except instead of drilling, you're building data centers that consume enough electricity to power small countries.\r\n\r\n## Why This IPO Changes Everything\r\n\r\nHere's the kicker?going public isn't really about the money (though obviously, it's about the money). It's about restructuring power.\r\n\r\nOpenAI started as a nonprofit in 2015. That setup was getting increasingly awkward as the company burned through Microsoft's $13 billion investment and needed more. So they restructured: the original nonprofit (now the OpenAI Foundation) holds about 26% of the for-profit OpenAI Group, with warrants for more shares if certain milestones hit.\r\n\r\nThis is brilliant, actually. It preserves the safety-focused mission stuff while unlocking access to public capital markets. Microsoft still owns around 27%, but OpenAI now has the freedom to raise funds without being entirely dependent on one corporate backer.\r\n\r\n## The Uncomfortable Truth About Revenue\r\n\r\nLet's break down the business model problem. OpenAI has 700+ million ChatGPT users. That sounds incredible until you realize only about 3% of consumers actually pay for AI services?roughly $12 billion total across the entire industry.\r\n\r\nSo OpenAI is doing what any smart company would do: pivoting hard into enterprise. At their October 2025 developer conference, Altman announced a \"huge focus\" on enterprise growth. They've struck deals with Spotify, Zillow, Mattel. They're licensing content from the Associated Press, News Corp, Axios. The vision? Turn ChatGPT from an app into \"something that feels a little bit more like an operating system.\"\r\n\r\nTranslation: they want to be everywhere, embedded in everything, taking a cut of every transaction.\r\n\r\n## Is This an AI Bubble?\r\n\r\nYou'd think so, right? These valuations sound absolutely batshit. But here's where it gets interesting.\r\n\r\nNVIDIA CEO Jensen Huang basically told everyone to calm down. In an October 2025 Bloomberg interview, he flat-out said: \"I don't believe we're in an AI bubble.\" His argument? The demand is real. Companies are actually using this stuff and paying for it. Gartner forecasts AI-related spending hitting $1.5 trillion by 2025 and over $2 trillion by 2026.\r\n\r\nHuang compared the current moment to the early internet?transformative enough to justify massive investment, even if it looks crazy in the moment. And NVIDIA's been riding this wave straight to a $5 trillion market cap.\r\n\r\n## Here's Why This Matters\r\n\r\nIf OpenAI successfully pulls off a trillion-dollar IPO, it doesn't just validate their business model?it sets a new benchmark for how AI companies get valued. It signals to every venture capitalist, every corporate board, every government that AI is _the_ infrastructure play of our generation.\r\n\r\nThe company is forecasting $100 billion in annual revenue by 2028 and $200 billion by 2030. They expect to lose money until 2029. And investors are apparently cool with that because the potential upside is so massive it makes traditional business metrics look quaint.\r\n\r\nThis is a bet on a future where AI isn't just useful?it's essential. Where every company, every workflow, every product has AI baked in. Where compute capacity is as fundamental as electricity.\r\n\r\nThe question isn't whether OpenAI goes public. It's whether the rest of us are ready for what comes after.\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/nvidia-ceo-we-re-not-in-a-bubble-openai-to-go-public"
  }
]