[
  {
    "id": "19a1e492034d751a",
    "from": "Joshua Clear <aiweeklydotcom@mail.beehiiv.com>",
    "subject": "Two Deals This Week Just Changed How A.I Will Work Forever",
    "date": "2025-10-26T02:11:39.000Z",
    "text": "### 100 Genius Side Hustle Ideas\r\n\r\nView image: (https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4151ba66-1db2-4349-8f6b-0e2f75f2ba90/Hustle_Incentivized_Signup_Ads_Project_2_Project_2_Opt_5.png?t=1745627807)\r\nFollow image link: (https://thehustle.co/signup-side-hustle-database?utm_medium=email-media-newsletter&utm_source=the-hustle&utm_campaign=VPSLCCALRN&utm_content=incentivized-beehiiv&utm_term=Version-A&_bhiiv=opp_bd9c858b-778e-47e8-a957-55771b78d169_23e578d8&bhcl_id=50a41a86-91d6-409d-8efa-fa07fd4f309c_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\nCaption: \r\n\r\nDon't wait. Sign up for [The Hustle](https://thehustle.co/signup-side-hustle-database?utm_medium=email-media-newsletter&utm_source=the-hustle&utm_campaign=VPSLCCALRN&utm_content=incentivized-beehiiv&utm_term=Version-A&_bhiiv=opp_bd9c858b-778e-47e8-a957-55771b78d169_23e578d8&bhcl_id=50a41a86-91d6-409d-8efa-fa07fd4f309c_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492) to unlock our side hustle database. Unlike generic \"start a blog\" advice, we've curated 100 actual business ideas with real earning potential, startup costs, and time requirements. Join 1.5M professionals getting smarter about business daily and launch your next money-making venture.\r\n\r\n[Get the guide](https://thehustle.co/signup-side-hustle-database?utm_medium=email-media-newsletter&utm_source=the-hustle&utm_campaign=VPSLCCALRN&utm_content=incentivized-beehiiv&utm_term=Version-A&_bhiiv=opp_bd9c858b-778e-47e8-a957-55771b78d169_23e578d8&bhcl_id=50a41a86-91d6-409d-8efa-fa07fd4f309c_1358dcaa-ca62-4a3e-96cd-c5ff13ec4abf_6234f2ce-90fd-4539-b098-42f6c1e01492)\r\n\r\n# The A.I Race to Own Your Desktop (And Why It's About to Get Weird)\r\n\r\nListen, something wild is happening in tech right now, and it's not another chatbot getting slightly better at writing emails. Two massive deals dropped this week that reveal where this whole AI thing is actually heading?and spoiler alert: it's not about chat windows anymore.\r\n\r\nOpenAI just bought the team behind Sky, this crazy-sophisticated Mac app you've never heard of, for what sources say is \"several hundred million dollars.\" Meanwhile, Anthropic signed a deal with Google Cloud worth _tens of billions_ to run a million TPUs. On the surface, these seem totally unrelated. But here's the kicker: they're both plays for the same thing.\r\n\r\nControl over how you actually use your computer.\r\n\r\n## What the Hell is Sky, Anyway?\r\n\r\nSky isn't another AI assistant. It's basically a ghost that lives inside your Mac, watching everything you do and helping you do it better. You hold down both Command keys, it screenshots your screen, understands what's happening, and can then... do stuff. Create calendar events from text messages. Find restaurants based on what's on your screen. Write code. Book flights.\r\n\r\nThe team behind it? The same people who built Workflow?the iOS automation app that was so good Apple acquired it in 2017 and turned it into Shortcuts. Ari Weinstein and Conrad Kramer basically taught your iPhone how to think in workflows. Now they were teaching your Mac how to think in natural language.\r\n\r\nThey raised $6.5 million from Sam Altman and others, built this thing in stealth, showed it to a few journalists who lost their minds over it, and then... OpenAI bought them before they even launched publicly.\r\n\r\n## Why This Matters (And Why It's Kinda Creepy)\r\n\r\nHere's what OpenAI is really buying: **the interface layer**.\r\n\r\nTwo days before announcing the Sky acquisition, OpenAI launched ChatGPT Atlas?an AI-powered web browser. Think about that for a second. They now control both your browser AND your desktop automation. ChatGPT isn't going to live in a little chat window anymore. It's going to be everywhere, seeing everything, doing everything.\r\n\r\nNick Turley, who runs ChatGPT, said the quiet part out loud: \"We're building a future where ChatGPT doesn't just respond to your prompts, it helps you get things done.\"\r\n\r\nTranslation: we're building a new operating system, and ChatGPT is the interface.\r\n\r\nThis is why the Sky team mattered so much. These people literally built the automation infrastructure that Apple uses today. Apple had them for six years after buying Workflow and still hasn't matched what Sky was building. Now OpenAI has that institutional knowledge.\r\n\r\n## The Anthropic Angle: Building the Biggest Computer Ever\r\n\r\nWhile OpenAI is buying its way into your desktop, Anthropic is building something even more audacious: the computational infrastructure to make AI that doesn't suck.\r\n\r\nThe numbers here are absolutely bonkers. Anthropic just committed to using up to one million of Google's TPUs (specialized AI chips) in a deal worth tens of billions. They're bringing over one gigawatt of compute online in 2026. For context, building a one-gigawatt data center costs around $50 billion.\r\n\r\nWhy? Because their business is exploding. They went from under 1,000 customers two years ago to over 300,000 now. From $1 billion in revenue at the start of 2025 to a projected $9 billion by year-end. Their code tool, Claude Code, is already doing $500 million in revenue after launching in May.\r\n\r\nBut here's what's fascinating: they're not going all-in on Google. They're also Amazon's \"primary training partner,\" with another massive project called Rainier using hundreds of thousands of Amazon's custom Trainium chips. And they're still using Nvidia GPUs for certain workloads.\r\n\r\nThis is chess, not checkers. Different chips are better at different things?memory bandwidth versus raw computing power, training versus inference. Anthropic is essentially hedging their bets while optimizing for everything.\r\n\r\n## The Deeper Pattern\r\n\r\nThese deals reveal something crucial about the AI race: it's splitting into two battles.\r\n\r\n**Battle One**: Control the interface. This is OpenAI's play with Sky and Atlas. If ChatGPT becomes the primary way you interact with your computer?if it's seeing your screen, understanding context, taking actions across apps?then it doesn't matter how good anyone else's models are. You're locked into their ecosystem.\r\n\r\n**Battle Two**: Build the best models. This is where Anthropic is focusing. They're 80% enterprise revenue (versus OpenAI's consumer focus), they're growing faster internationally, and they're investing absurd amounts in computational infrastructure to stay at the frontier.\r\n\r\nHere's the thing that keeps me up at night: Sky needs extensive permissions. It's recording your screen. Accessing application data. Performing actions on your behalf. OpenAI says this will be \"optional and fully under user control,\" but like... we've heard that before, right?\r\n\r\nAnd the TPU deal? Google just locked in one of AI's biggest players as a massive customer, validating their custom chip strategy and taking a swing at Nvidia's GPU monopoly. If Anthropic proves you can train frontier models on TPUs instead of Nvidia hardware, the entire AI infrastructure market shifts.\r\n\r\n## What Happens Next\r\n\r\nWe're watching the formation of new tech superpowers in real-time. OpenAI is becoming a platform company, not just an AI lab. Anthropic is building the infrastructure to compete with OpenAI's massive lead. Google is betting its custom chips can break Nvidia's stranglehold. Amazon is trying to be the primary cloud provider for the AI age.\r\n\r\nAnd somewhere in Cupertino, Apple is watching the team they acquired in 2017 get re-acquired to build the exact thing Apple Intelligence is supposed to be?except OpenAI might ship it first.\r\n\r\nThe race isn't about who builds the smartest chatbot anymore. It's about who controls the layer between you and your computer. And honestly? That's way more interesting?and way more dangerous?than anything we've seen so far.\r\n\r\n\r\n???\r\n\r\nYou are reading a plain text version of this post. For the best experience, copy and paste this link in your browser to view the post online:\r\nhttps://www.aiweekly.com/p/two-deals-this-week-just-changed-how-a-i-will-work-forever"
  }
]